[
  "Balboa Park is definitely one place to visit if you're ever in San Diego. I feel like it's in the middle of the city and if you go to anything else...",
  "Even though it was gloomy and breezy out! It didn't stop us from visiting and strolling around this park. All the talk about this park really exceeded my...",
  "This is definitely a must see for people visiting. I would say this is one of the top 5 things you should do while here for the first time. Unfortunately, I...",
  "Ordered for take out. Food was well packaged. Everything we ordered was there. Ordered extra fried rice because it's that good!",
  "This was our first time during the pandemic to have ordered take-out from Edo-Ya-Tokyo Cuisine. We were not disappointed. It was wonderful!  It felt very...",
  "My absolute favorite place in the whole world to eat tepanyaki! No one can match their flavors or sauce! Not to mention the bacon fried rice that absolutely...",
  "I'm so happy this restaurant is able to operate during COVID. We are visiting Yosemite from Southern California and stopped in Mariposa for dinner at...",
  "Super super super bomb ... located right in the middle of Mariposa ... beautiful indoor setting with ridiculously good eats ... we went for Valentines Day,...",
  "A wonderful dining experience all around. Hostess and servers were hospitable and accommodating. COVID friendly. Food was wonderful.",
  "This place had a really fun atmosphere. I enjoyed checking out the baseball paraphernalia. It seems like the owner has some friends in high places ;)...",
  "Great spot for comfort food after a day on the slopes! The wait staff was friendly and accommodating and made sure we were comfortable with the outdoor...",
  "Toomey's\nDriving down the 395 from South Lake Tahoe we decided to take a slight detour and drive into Mammoth Lakes for a lunch stop.  Never having been to...",
  "Had a great dining experience. Probably the best service we had on our trip. From the time we were sat until we left we were attended to at all times....",
  "For starters, the service here was 10/10. The hosts Stephano and one other guy (didn't catch his name) were very friendly and helpful when it came to...",
  "It's been about 4-5 years since my last trip here to Campo. I'm so glad I ordered tonight. The pick up process was seamless. Our order was ready quicker...",
  "\"Milk is for babies. When you grow up you have to drink beer.\"--Arnold Schwarzenegger\n\nTLDR: Probably our most enjoyable meal all-around in our 5 days spent...",
  "Awesome spot. They have a series of outdoor tents to be compliant with COVID and warmers around. Feels like camping. \n\nFood is hearty bar food that you want...",
  "So my boyfriend and I were just ending our week long trip in Yosemite, a little hungover and about to head back to LA, and just happened to pick up two...",
  "If you're staying outside of Yosemite or exiting route 140, check this place out! They have lots of covered outdoor seating with new heat lamps and indoor...",
  "We live in Oakhurst and between Oakhurst & Mariposa this is our favorite restaurant. They have a wonderful outdoor dining setup for those concerned with...",
  "My boyfriend and I ate here 2 days ago and the service was stellar. We ate outside (they have both outside and indoor dining) and felt totally safe eating...",
  "We were in search of good Mexican food on our short trip to Mammoth. \n\nIt was a Saturday night, we called a few times to place a takeout order but there was...",
  "I was a bit skeptical when my bf recommended this place and claimed they had good Mexican food. I'm already overly picky about Mexican food as it is, and I...",
  "As a Los Angeles native, I've not had Mexican food quite this delicious and authentic in a long while. And to think such an amazing restaurant is out here...",
  "This was our first dine in at Mammoth since Covid hit. What a pleasant surprise. Nice atmosphere, beautiful views and superb service. The meals were served...",
  "Amazing food and service!!! Really fine dining from a French Chef. Worth every penny. I absolutely recommend it. \nThey have a terrace with a nice view. They...",
  "THE FOOD IS AMAZING.  Very organized pick up process.  Portions were generous and all the flavors were delicious.  I can't wait to eat inside once the COVID...",
  "We had an amazing second experience here at Convict Lake. We tried the fettuccine al pesto, the Long Island Duck, and the Beef Wellington, meat was very...",
  "Come up for my husbands birthday decided to eat here because it was late and didn't want to drive around.  This was great lucky they had room in the bar...",
  "Food was outstanding! I had the cream of carrot and ginger soup with the cashew crusted rainbow trout. Hats off to the chef. Due to COVID we were seated...",
  "Service was great. Just moved indoors. No more than six people at a table but this is fine to put our children at the next table. Giant pretzel is always a...",
  "I was glad that this place was still open during covid. We got a big table outdoors and enjoyed the view near Main Lodge. The beer selection is huge. The...",
  "We came here for thanksgiving lunch. This was our second time at this restaurant. There was indoor dining offered. Service was fantastic. Food was good....",
  "Before Covid, this was the go to spot to eat at for lunch or dinner or even happy hour with the girls when we get together. Had birthday dinners here as...",
  "Had a perfect date night here Thursday, May 13th. It was the last second choice for my girlfriend and me after a Grizzlies Game. It was our first time...",
  "I'm so glad this place is slowly coming back to normal since COVID hit. Great outdoor patio dining area that's shaded pretty well so the suns never an...",
  "It was our first time back since COVID craziness hit, and it was just as good as it always was! This family owned, family run restaurant never disappoints....",
  "Came here for lunch with my wife while out on a shopping trip, first time.  Socially distanced tables inside and the waiter wore a mask, which was fine with...",
  "The food was good. We had to wait a long time. With all the Covid restrictions I understand. Owner was super nice and just really cared if we were happy....",
  "As this place is sharing a Korean noodle house for their barbecue takeout restaurant, I was not expecting much. Boy was I surprised! I had the hybrid...",
  "I got the chicken bbq sandwich as as soon as I bit into it, I got chicken skin with rubbery stuff, not the first thing you want to taste biting into a...",
  "We were excited to see that Players BBQ reopened. However it's not the same. They are now located in Pho Dera. Horrible customer service and bad bbq. We...",
  "With such mixed reviews we didn't know what to except, but we were pleasantly surprised. We both had the fillet mignon and the meat was delicious and the...",
  "Server was awful( took a while to get to us, did not give us a salad that was supposed to come with dinner, drinks were weak, lied about the desserts they...",
  "Excellent western decorations and the staff is very attentive. We had drinks at the bar. I suggest you take time for this.  The burgers was amazing and my...",
  "My husband and I stumbled across The Resting Nomad on our trip to Mammoth during the Coronavirus pandemic. Luckily they were still open serving the locals &...",
  "Tucked just back from Main Street in the Best Western Motel.  They have their own marked parking just before the doors.  Yoshi, who prepares all of the food...",
  "It's off the beaten path, located in the Best Western motel on Main Street.  Our server/cook//cashier/manager did a good job. I guess everyone called in...",
  "Yes, this restaurant has a billion reviews and they are all 5 stars, and I am here to tell you that they deserve every single one of the 5 star...",
  "A very solid fine dining experience, and also my first one during COVID-19.\n\nMy five friends and I decided to spend a week in Mammoth Lakes, doing some site...",
  "Holy moly! One of the best meals I've ever experienced! And this was for a takeout order, no less! We got the scallops, steak, hamachi, salmon. Everything...",
  "Stopped here because of the reviews. Alex who took care of us was on point. Great customer service. I could tell it was slightly busy and he was still very...",
  "After a nice long hike in Yosemite we were starving and found this place on our drive back home.  The restaurant is very pretty but due to Covid there is...",
  "I have to say I am so glad the Mexican food restaurant was only doing take out here in bass lake so we took a short 15min drive into Oakhurst.\n\nI have to...",
  "We'd eaten here previously, but it was years ago.  They have outdoor seating or take out, we ate outside in the umbrella covered patio.  Ashley was our...",
  "We eat here every summer when we visit Shaver Lake - with Covid rules, you can either sit outside or get takeout - we got ours to go, and while it was ing...",
  "My family and I ordered takeout from Shaver Lake Pub 'N Grub, and while it wasn't the cheapest meal I have eaten we were all incredibly pleased with their...",
  "Loved my recent stay in one of their cabins.  Cabins are\nrustic but comfortable.  Firewood is provided daily for the outside\nfire pit.  There are beautiful...",
  "We went skinny dipping in Lil Eden since we had it all to ourselves. Temperature was perfect and it was so relaxing surrounded by the snow capped mountains....",
  "My nightmare was rudely interrupted by my tent-mate Shin. The stars were still in the sky when I crawled out of my sleeping bag that lay atop the provided...",
  "Phenomenal place. Will definitely be back again. In a nutshell, a trendy Italian American cuisine with a fresh selection of drinks paired with welcoming...",
  "Easily in the top 3 restaurants we dine at regularly in the Fresno/Clovis area. From the first time I dined here when they opened to today and all through...",
  "Their new patio seating is sooo cute! It's starting to get a bit chilly but the waitress mentioned they were getting new heaters in soon. Once they're in,...",
  "What an absolutely amazing hidden gem! I was visiting the area to hike the Yosemite valley and decided that I had spent enough time cooking at my AirBnB and...",
  "Walking into The Elderberry House is like entering a peaceful, beautiful European oasis, tucked away (but in plain site) in Oakhurst. We came here for a...",
  "We ate here on the patio last weekend during our visit in the area. The seemed to have follow the right protocols and we felt safe. The service was great...",
  "My husband and I were celebrating our 38 year anniversary and normally go to Ruth Chris but because of COVID decided to do takeout.  Went to Rev's for a...",
  "Found this place on our way home. Most of us had breakfast,  homemade strawberry jam, maple syrup and ketchup.  Fresh biscuits right from the oven....",
  "Wow!  Possibly the best breakfast I have ever had!  Patio seating is available in the back.  I had the spinach and mushroom quiche.  Not only was it HUGE,...",
  "My husband and I ordered the chicken fajitas as a pickup order! The gentleman was pleasant and attentive over the phone. I was impressed to get there and...",
  "The service was excellent! The food was delicious! Be glad when Covid is over so we can sit and enjoy while there! SAL'S was recommended from employee at...",
  "Just wanted to say that we started going here shortly before the pandemic, and still went after afterwards when the restaurant was still open indoors. The...",
  "So good! Support them if you can! They are open for take out only during this covid shut down, but they make it simple, at the door or drive up window! They...",
  "Best egg flower soup. Get without vegetables for more traditional feel. Garlic chicken plate over pan fried noodle is good too but it does come with a lot...",
  "Good food, good prices, quick service.    I Love having Chinese food out here. Not having to drive all the way into town",
  "Heirloom is such a Fresno treasure! Their from farm-to-table aesthetic and mission clearly translate into their quality of food. It is a little more pricey...",
  "I'm not really familiar with the Fresno dining scene but this restaurant is amazing.   Their menu is so diverse and has many different options for every...",
  "Woah... hands down one of the best restaurants I've ever been to. Honestly, I didn't think I would find such a gem in the small town of Fresno. I ordered a...",
  "The Ark has some of the most diverse Mediterranean food. The humus is awesome and the meat will melt in your mouth. They have full dinners and bowls for...",
  "Stumbled upon this spot as a takeout recommendation during these quarantine times and my family and I are very happy to support this local business.  We...",
  "The food here is always great quality. One of my favorite quick take out spots in the Fresno area.",
  "I think right now people are looking for reviews during these heavy restrictions, or even just those that want to know how restaurants are doing with take...",
  "Came here for a birthday dinner for my mom and was pleasantly surprised. Like so many people, our original plans for her birthday were changed due to COVID....",
  "Was very sad this past\nVisit to mammoth that like many places closed due to COVID. I hope they will open again such awesome food prepared their way",
  "First Impressions: Greeted with a smile when walking in, waited for about 15 minutes on the wait list before being seated immediately following a phone...",
  "Once again another great experience!  \nWe participated in a \"peaceful protest\" at one of Old town Clovis' mainstays...  I had the burger in the bowl (trying...",
  "This was my second visit, and I'm not sure why I've been here so few times. The only reason I can think of is because there is usually a pretty long wait....",
  "One trip two part review.  This review will be first on the restaurant and then their cabins.  You would want to read the whole review if you are planing to...",
  "Great stop during a day of activities at Bass Lake.  The Forks has a covered outdoor dining area with plenty of shade and breeze.  Due to C19 the indoor...",
  "This was a exciting day for our family. We have been cooped up for months and we're dying to get out of the house and to get a Forks Burger. It was very...",
  "Cheesecake Factory is not usually my first choice, but today may have changed my mind on that. The food was nice and hot and the service was great. Anthony...",
  "Cheesecake Factory never fails to satisfy me. The food is always amazing here and the ambiance is always poppin. Decided to drop by for an adventurous...",
  "We arrived on a Monday afternoon. We were told our wait would be about an hour, so we sat and waited. Due to COVID the indoor seating area was closed, but...",
  "I've been here twice now and haven't actually seen the inside of the dining room. First visit was a few years ago for a wedding. This past weekend I was in...",
  "This place is amazing! Came here for a date last week and the food, environment and staff were all awesome. The ambience on the patio was sublime and img...",
  "Although I've lived in Fresno County my entire life, last Friday 4/2/21 , was my very first time at School House--wow I have really been missing out. This...",
  "I travel to Shaver Lake frequently for work. On my last trip, I wanted an easy meal I could eat as take-out in the hotel room after a day of travel. I was...",
  "This spot was really great, food was awesome. Easy to order, all outdoor seating, clean, restroom was clean just needed to wear a mask to use. There was a...",
  "After camping for 7 days straight and cooking our own meals, this was a TREAT!! We found this place easily while in town getting gas. The sign doesn't do it...",
  "Not having reservations, we were greeted by a great server (Gary). He gave us a great run down of the menu and offered some suggestions. We had a Focaccia...",
  "This was the first restaurant we tried when we relocated here, and it did not disappoint. \n\nThe indoor ambiance reminds me of French Bistro and an Italian...",
  "A nice quaint Clovis restaurant that is open on Sunday. Food was great, authentic and fresh. Service was awesome and friendly. Restaurant is clean and Covid...",
  "We popped in here after trying out several other restaurants in the area and they were the only ones able to seat the two of us without a wait. The...",
  "I Yelp religiously, especially when in a town I'm not familiar with, heeding the advice of fellow users when it seems appropriate, but often brushing off...",
  "We had a couple of flatbreads , the Bison meatloaf, and the Bison chili and it was good, not great, but good. Service was sufficient and our server was...",
  "Stopped here with our lacrosse team to pick up lunch and the service and food was amazing. The food was ready at exactly 11:30 and the manager was very...",
  "This was the first time I've ever been to The Vineyard. This place has been on my radar for a while, and I've driven past a bunch when I'm returning home...",
  "Covid-19\n\nMy mother called in the order. She ordered the turkey pesto and CA clubhouse with jalapeños and both with side salads. CA clubhouse with no mayo....",
  "Jackalopes was a mainstay of our Mothers Day weekend visit to lower Yosemite. The area is coming out of the COVID shutdowns and Jackalopes is leading in the...",
  "This was the first time we've done indoor dining since COVID hit and it was a pretty good experience back. Service was friendly but a little slow. Tables...",
  "The carnitas nachos are solid. Enjoyed them so much the first day that we came back and had them again the second day staying at the Tenaya Lodge. \n\nThe...",
  "COVID-19 phase: masks worn by workers and required. \n\nMy very controlling mother controlling per usual. She wanted this place  for tomorrow so she called...",
  "Love that they have online ordering right now. I placed my order with them online (super easy) and set the time for pickup. When I got there at the exact...",
  "COVID-19 times, and I really enjoyed our visit! They have tables set up outside with umbrellas and there are sanitizing wipes on each table. They prefer you...",
  "Although it's still only take out they fix you up good. It is prepared quickly by very friendly staff and the food is great. Always sto in when in the",
  "Very cute place with nicest hostess. Good food and diverse menu. They are known for the best burger in town. We went to check it out for ourselves and they...",
  "10 friends and I are renting a house in this area for a week. The owner recommended this place for dinner and drinks. \nWe called about 15 times and nobody...",
  "This is your COVID-SAFE move for frustration-free access to booze and food apres shredding.\n\nIt's been a solid 11 years since I've been here and while I'm...",
  "My boyfriend and I stopped by here on our last night in Mammoth for a quick Happy Hour pick-me-up. The place is very unassuming from the outside but the...",
  "An overall decent place for food/drinks during COVID times that has spacious seating and quick service!\n\nParking: located at the village, parking is across...",
  "One of the nicer dining areas within Yosemite National Park. After a long day of hiking, I was most certainly not disappointed!\n\nATMOSPHERE/ARCHITECTURE:...",
  "Not sure if it's just me, for some reason I had no appetite while I was in the Valley. Must have been all the fresh air because it certainly wasn't...",
  "I was convinced that we were going to get some grumbly wait staff with a giant wedding dinner party of 20 or more. Impressively, they were calm and patient...",
  "Just got back from dinner at the Austria Hof restaurant with my bride of 43 years. \nDining inside with social distancing protocols enforced. Wait staff all...",
  "Austria Hof was the best restaurant we had during our stay in Mammoth. Mammoth allowed for indoor dining (probably due to the chilly conditions) and we took...",
  "In door dining is a hard find during this pandemic especially when in Mammoth and you'd prefer not to freeze outdoors while trying to enjoy a meal. Look no...",
  "Stopped in and ordered dinner to go. Service was excellent. Food was delicious. Asada garlic fries=super yum. Carnitas chimichanga=super yummy. Tacos=super...",
  "One of my favorite Mexican restaurants,   thankful that it has survived Covid! A huge menu filled with great choices. Love that the dishes are made to...",
  "Safe 6ft distance on outside patio masks are worn so thank you for the safety , the food is delicious and the service is great.",
  "Florentina's is becoming a new favorite for all things Italian.  My favorite dish is their Calzone.  I can easily make 2 meals out of it.  The dough is...",
  "So yummy!  Got an 8\" pizza combo.  I didn't know what to expect, I usually go to the places where you can build your own because I love lots of toppings so...",
  "Found on yelp, good reviews. I really wanted spaghetti, I really like garlic bread. Food was ready when I got there, came with a salad (not extra like at...",
  "This resort was dreamy! If you enjoy serenity, breathtaking views, and the peaceful sound of birds you will love this place. I came here to celebrate my...",
  "February 2021 As always we had a good time. We choose to go during the week instead of a weekend because of the crowds. Service checking in & out was nice....",
  "The review is primarily due to Skyler who has been working at the pool area the past few day....\n\nThis girl is ontop of it and deserves some...",
  "Food is great! But I'm knocking off a star due to lack of time management and customer service. Here are a few tips before going to the restaurant during...",
  "Excellent food, good wine selection and love the cheese bread. The waitress was nice and explained how to use the tabs since it was our first time there. It...",
  "They have a lovely outdoor patio! Great food, service, and drinks. Very friendly staff who are extremely attentive and want to make sure you are enjoying...",
  "I decided to try this place on a whim without checking the reviews first, and I'm glad I did! The restaurant is small but clean, and there was plenty of...",
  "They get one star but honestly I would give  zero stars, I believe it was the owner's that were taking my order. The rudeness was unbelievable First of all...",
  "Have been going here since I was little and I love this place always get the wontons and shrimp fried rice sooooo good",
  "7/10/20 \nOrdered some dinner from here. So I had the grilled  unicorn fish with scalloped potatoes, steamed veggies, and a side salad with their homemade...",
  "Service is tremendous! Especially during the pandemic, the staff works hard to get your order just right and really takes the time to understand what your...",
  "Consistently great food from this restaurant.  I love their fish dishes with capers.  Delicious!  Staff is very friendly and helpful and always greets you...",
  "COVID-19 Phase:\n\n My mother ordered 6oz sirloins. You get 2 sides. She talked to Hannah who was very kind. The sides picked were Mac N Cheese and broccoli....",
  "I've been to this Applebee's a few times, and have always left happy.  I like how it's tucked away from the busyness of the other restaurants, which creates...",
  "I entered the patio without my mask because I was in the patio already.... My friends were seated already. A diner demanded I put on my mask as I pass them....",
  "COVID-19 phase \n\nI called in and ordered a grilled chicken bowl with vegetables, boiled beans and jalapeños. The worker said it would be ready in 15...",
  "Everything great.service is fast and dont have to wait long for food.althoughbibused to dine in frequently. I still get take out alot",
  "My family and I have been dining at Casa Maria's for about 3 years now. It is our home away from home. We celebrate every family occasion there. We are...",
  "The service was good and the environment is warm and inviting. However, I'm sorely disappointed in the food. I ordered a breakfast burrito (chorizo, eggs,...",
  "My boyfriend and I came here to eat. He got a Chorizo plate (Breakfast) and I got a chicken taco. His plate comes with eggs, beans, rice, and potatoes. The...",
  "COVID-19 phase: \n\nLunch break! Yes please! I called in and asked what was more popular, the chicken wrap or the chicken burrito. The worker was very nice...",
  "I've been waiting a long time for this place and it is amazing! I ordered takeout. The interior is decorated in a very classy, unique way. Food was...",
  "Best Kabob place on West side of Fresno. Ample outdoor seating. Tender beef and chicken. Very good garlic sauce",
  "First time trying this place out and the my fellow yelpers help us decide on what to get.  And we were pleased! \n\nThe customer service was great! The lady...",
  "We walked into this restaurant for the first time and the owner approached us so aggressively about she having the best food in town and 5 star reviews on...",
  "The owner will tell you straight out! \"This s!#&, the bomb!\" \nFor once, that is not an exaggeration. Spicy shrimp was fantastic. The shrimp was flavorful,...",
  "Great go to spot for Pho. We went there before COVID and continue to go now with takeout services. They have the best tasting broth and either Pho it's all...",
  "great food, large menu and the PHO is excellent. def a place to go and try. ive done takeout here several times and there's always extra utensils which helps.",
  "Food was great! So glad I could come out to support this local restaurant.\n\nThai style papaya salad with fried chicken 7/10\nFried chicken was very fresh and...",
  "First time here and I definitely will be returning! I discovered this place on Instagram and saw that they were open and outside seating. When we got there,...",
  "Fresh and flavor is spot on! \n\nDriving back home after a little work, I stopped at Hino Oishi for that taste you can only get from a GOOD sushi restaurant....",
  "Easily one of the best meals I have had in Fresno! They have patio seating, so you can sit down and eat here. We ordered a bunch of things to share, and we...",
  "Meh. We had to do take out because the wait to dine in was 45 minutes. Glad we did because there's a chance that by the time we get a table, they're...",
  "I never write negative reviews but I feel like the owners need to check on what they're serving to the community. This is a review from about a month ago,...",
  "Came in for dinner after a day in the slopes because we were craving for Asian food. Despite the Yelp reviews, we always want to go see for ourselves. Red...",
  "COVID-19 phase: \n\nI ordered a chicken shawarma. The worker was very kind. He said it would be ready in 10 minutes. I went to get it. The worker was masked...",
  "Our meal was very good! The rice pilaf was perfect and not undercooked or over cooked! Chicken and sauce inside was amazing! The falafels were very good as...",
  "The dude and I have been chowing down TO GO at Falafel Express since mid April 2020  as I have been on a Hummus kick for the past two weeks. Plus...",
  "Staff is welcoming and attentive and it feels great to support a family-owned business. We sat socially-distanced indoors and felt comfortable with the...",
  "Got takeouts from this restaurant when my boyfriend and I were visiting Yosemite last weekend. Food and service were amazing! Highly recommended!!\n\nWe...",
  "Saw a good rating. As most restaurants are mostly take out. We stopped by and ordered our food. It took about 20 minutes for our food but it was worth the...",
  "Called and ordered 2 simply grilled chicken sandwiches with pepper jack and jalapeños added and side salads too. One with thousand island and the other with...",
  "COVID-19 era update. They now have tables set up alone the sidewalk and parking lot area in front of the door. We arrived just before 5 and there was only...",
  "I love that they added delivery for customers during COVID-19. We ordered food and had an issue with an item missing. I spoke with management and they had...",
  "This place is pretty good. Lately the service has been a lot better. They even haul out heaters to patio diners upon request. \n\nI always opt for the tuna...",
  "New favorite! I went with a recommendation from the server Neidelyn on her favorite \"downtown spicy  chicken\" and another not spicy dish of \"ginger beef\"....",
  "Such a nice patio and great selection of draft beer and sake. Lots of variety and healthy choices on the menu. Our food was flavorful, fresh and delicious....",
  "I don't enjoy sushi but when I do it this place, even in this time of surgical masks and hand sanitizer good restaurants are still to be found and enjoyed....",
  "Been to this place twice now and it is amazing. Some of the best fried rice (bacon) I've had in town. Really good hot n spicy sauce and they are very...",
  "I was told about this place from my child. I was so impressed. We wanted to try it in the restaurant but covid has us taking it to-go. The bacon rice was...",
  "They're taking great precautions against COVID-19 spread! They have outdoor seating and their pickup is efficient and safe. And the food is still great!",
  "Can't go wrong with this place. Currently doing take out only. Where else can you get a 3 course meal? Service was great too.",
  "Great food, great service!  Glad we went for Mother's Day.",
  "I'm not going to exaggerate. This is the best Mexican food in Fresno. I grew up here in Fresno. Ive lived in San Diego, I've traveled throughout California...",
  "Great spot for Mexican. It was my first visit with my Boss-FratBro. I had Machaca and it did not disappoint. A tender, crispy, meaty not so eggy. Corn...",
  "Oh my well this is the first time trying their menudo. Umm I hate to say it was super greasy abs the trip had a lot of fat on it. Plus it had that smell....",
  "Moved back to Cali and Ooi is as good as ever missed this place take out only still same great rolls highly recommend",
  "First time trying this restaurant, we did carryout.  Great experience with great rolls.\nOrdered four rolls and tried three different rolls and a seaweed...",
  "Fantastic food for an affordable price. Never ate an item that I didn't love. I'll swear by ooi til the day I die. They follow covid regulations well too....",
  "Our service made up for what I'd regard as relatively mediocre 3/5 food. The price was fair for what you got. The wedge salad was okay. I was disappointed...",
  "This was such a cool place to dine in during  COVID in October. Guests were seated two to three booths apart. It was so quiet and peaceful. Only three...",
  "Had a wonderful meal here the other night. It was quite crowded, but we got excellent service and the food was very good. I had the teriyaki salmon with...",
  "Fantastic service! Food was very good and the cocktails were excellent! We went during Happy Hour which was a great value for the quality you get. Grey...",
  "came here during happy hour just for a round of beer after a long day of shredding.\n\ngot a glass of allagash for myself and pacifico for a buddy of mine....",
  "We were excited to try this place because of the reviews but highly disappointed. Waited at the hostess stand for extended time with another customer while...",
  "I wanted to try everything on the menu!  Ended up ordering the pork verde keto bowl (stewed pork with spicy green chile, served over shredded cabbage and...",
  "COVID-19 update. Went to breakfast with mom and son and had a lovely experience. Las Mananitas has set out tables under a canopy with bamboo \"walls\" in the...",
  "Wow, so impressed by this place. The food had the best flavor of any Mexican restaurant I've tried in Fresno. We've now lived here for 5 years. The small...",
  "We stayed nearby this past weekend and stopped by to grab breakfast because we saw they had biscuits and gravy. The place looks so unassuming when you're...",
  "Oh. My. Goodness. This place was so good! After a disappointing breakfast at our hotel restaurant the night before we decided to try something on our way...",
  "Very nice ppl, tasty food, vegan options, and they're being careful about COVID.\nAlso I asked for extra ketchups for my kid and the person at the  counter...",
  "This is my favorite spot for Mexican food in town! Their chips and salsa are always fresh (and refillable), the staff is super friendly (our waitress from...",
  "Told my mother how good Jesses Fit special was when I Yelped it one day at a different Toledo's and she wanted it today. \n\n\nMy mother called in the order...",
  "Service is excellent and prices are reasonable I've dined here a few times and happy hour is great they offer great deals and $5 margaritas they have indoor...",
  "Food is tasty. \nMargaritas are delicious \nPrices are high (you are in Mammoth, so what's new)\nEverything during COVID-19 is to go",
  "We were looking for a lunch spot before checking into our Airbnb and decided to stop here. We figured you couldn't really go wrong with Mexican...",
  "Covid continue indoor and outdoor dining. Served quickly and food arrived fast. Food was amazing! Ordered the nachos, the Mexican fries, and their trio...",
  "It was a hot day, but Colton's had misters all around their outdoor seating area. My party waited about 20 minutes for a table during prime dinner time...",
  "Such amazing food! We visited on a chilly afternoon and did the patio dining. Without any hesitation the host quickly turned on the heater at our table....",
  "I have been going to coltons regularly now for 3 years and in those 3 years I have never been disappointed! I go for work lunches, girls night out, and date...",
  "This place is so yummy. You should do an online reservation tho. We tried to just do a walk in on a weekday and nope... it was a 45 minute wait!! On a...",
  "This place is so good that this is my fifth review and five stars for a home run take out breakfast amidst we are still in a pandemic.\n\nWe placed our order...",
  "Delicious Chile Verde breakfast burrito!  Upon the recommendation of a friend we order breakfast for pickup on a Friday!  The burrito was so good, the pork...",
  "This place was a gem in the most unlikely place. The service was outstanding; everyone was friendly and the cook came out to greet us. \n\nWe had Micheladas...",
  "Awesome find in a sketchy area. This year, I'm trying to hammer through these bookmarks which have heavily accumulated over the last couple years. Mi Cielo...",
  "Molcajete for 2. Shrimp  carne asada, chicken, nopales ( cooked cactus) in a big black stone bowl.  \n\nWe were looking for a Latin American steak restaurant...",
  "Yum! Excellent pizza in a beautiful location. We were staying in Squaw Valley on a weekend getaway and this was perfect for carryout dinner. We got the 12\"...",
  "I was recently in Squaw Valley at my grandmother's house and didn't feel like cooking. The restaurant options up there are pretty limited but I'm very glad...",
  "Ordering was very easy on our way to Kings Canyon, and no wait at the drive through. We ordered the Polar Bear in the Papa Bear size. Couldn't be happier!...",
  "Went here with a big group (6 adults and 3 kids) and they did an awesome job accommodating us albeit through the COVID restrictions. Good cocktails and...",
  "I visit my mother in Mariposa often and our favorite place to dine is Savoury's.  Great meals, great service and a great atmosphere.  The beef & pasta...",
  "We live in Mariposa, and are so  thankful they  were able to re-open in time for Valentine's Day!  We had a delightful meal, beautifully prepared and served...",
  "My husband and I love this place. We've ordered out from here several times during the whole pandemic. We've ordered many different things and almost every...",
  "I'm obsessed with the kebab salad. So delicious nothing else like it in town. The prices are a bit high but the restaurant is beautiful and the service is good.",
  "Horrible customer service, food was sub par. Wasn't closed & refused to serve. Idk man... I'd go to literally any other Mexican restaurant",
  "This place has the best hookahs and Arabian food in town. \nThey host private events for those who are interested.\nYou can put ur own music on, They also...",
  "I can't judge the hookahs, only the food delivered to me.  The hummus had too much tahini so I couldn't taste anything but tahini.  The bread was nice and...",
  "Tried this place for lunch on a Sunday. It may be mostly hookah lounge but the food is delicious. I didn't go into the hookah lounge part, the door to the...",
  "Located in the heart of old town Clovis, this is probably one of the most up to date dining experiences in the area. \n\nGreat for a younger crowd to enjoy...",
  "1st time at this restaurant and my 1st post quarantine meal it was Amazing! Went in for lunch it was a nice relaxed casual atmosphere. Ordered steak with...",
  "One of our absolute favorites. The owner is a polite and welcoming young man. He's been through some ups and downs trying to open this restaurant during a...",
  "The best food anywhere!!  You won't find better take out!  Katie has a relationship with all her customers!  Every dish is amazing and I bring all my out of...",
  "Five stars because this small town cafe with very few tables has the most delicious food and service. Tangerine beef, an absolute favorite of mine, is on...",
  "Katy is by far my favorite restaurant. We have been driving from Madera to Kerman to visit Katy at the Beijing Garden for about 15 years now and it's by far...",
  "COVID-19 PHASE: \n\nEaster luncheon of prime rib and ham ordered last week. Prime Rib for my mother and I and ham for my grandmother. I went with my mother to...",
  "The food and service was amazing! This was our second time dining here for lunch and it has quickly became one of our favorite lunch spots! Although we did...",
  "Y'all did some wooooooork. This food was soooooo good. I am on short term assignment for work and went out of my way to try this. It's still covid season so...",
  "Home cooking always hits the spot when camping...\n We were camping next door at French Camp when the weather turned threatening leaving us not in the mood...",
  "Great place with a charming atmosphere. Has a full bar and a general store. Food is yummy comfort food with some healthy options as well. Friendly staff. A...",
  "Their menu states to please be kind as many small businesses struggle during covid 2020. Our breakfast was absolutely delicious and really tasted like home....",
  "We've been going here for years and like always, the food and service are top notch! Me enjoyed perfect weather on their relaxing patio. My favorites dishes...",
  "Picked up food to go.  Because we weren't dining in we kept it simple - pasta, bread, salad.  Everything was fresh, the pasta was cooked perfectly and the...",
  "Late Mother's Day dinner. It was DELICIOUS! We ordered the spinach and Caprese salads for appetizers. The wine paired with the homemade pasta were PERFECT!...",
  "The best sandwiches.  Great service and clean.  Menu is easy to ready,  but hard to choose from because it is all good.  The Thai fries rice is great.  I...",
  "What to say about this Vietnamese place! It is empty! While traveling to Fresno, I stumbled across this hidden jewel on the side of Shaw Avenue. It didn't...",
  "If your looking for a good pho and spring roll place this is it! I was surprised by how good it actually came out. I'm usually picky about pho but they did...",
  "Tip: Order a side of gravy to dip your chicken! It is amazing! Your chicken stays extra crispy and then you can smother each bite with gravy!\n\nThis review...",
  "Holy moly it was so good! The stars of the show were the fried chicken, Mac n Cheese, and the fried green tomatoes. The guy was even gave me a slice of...",
  "Chef Paul's has the type of menu where I want to try absolutely everything! There are a lot more menu items to try but their jambalaya and gumbo are my...",
  "Best restaurant in the Central Valley.  Amazing food and and atmosphere. Beautiful patio and brand new bar. Highly recommend this restaurant if you like...",
  "My girls & I went out for dinner during this covid plague and had the best time here. They have misters outside to keep it nice and cool when you sit...",
  "Great service. Went one week ago (9/5) and the staff was friendly , wearing masks. Tables were spaced out the patio had fans and was nicely lit. It felt...",
  "This place is literally my favorite burger place! The owner is genuine, down to earth, friendly, and kind. As soon as you walk in you are greeted by the...",
  "Super nice people. Went here during quarantine to pick up some food. Very nice and kind people and accommodating to us. Will definitely go back. \nFood was...",
  "Decided to pop in to support a local business during the Covid-19 shut-in. Ordered a deluxe turkey burger and a half order of chili cheese fries. The turkey...",
  "Located throughout California and Arizona is a a restaurant chain known as Ono Hawaiian BBQ.\n\nCreated by Joe and Joshua Liang, the restaurant concept is...",
  "We ordered this for delivery and were surprised at the size of the order.  We tried the barbecue chicken and it was delicious - moist and packed with...",
  "Came here to pick up order during quarantine. I like their new packaging its better than Styrofoam. Really big meat portion Thank you guys s",
  "Covid-19 phase:  \n\nThank You Yelp for making it easier! I ordered and paid for it that way. Chose everything I wanted in it. \nThen I received an email to...",
  "Stopped here on the way home. It was my first time here and actually trying anything like this. The workers were nice and friendly and let me sample some of...",
  "Went in today to try this place again to see if things have changed since my last review. THEY DID!! All the employees were wearing masks which I very much...",
  "Very nice patio dining... sitting next to the fountain, eating Eggs Benedict, Mimosas, listening to the piano man...  playing piano",
  "Was looking to spice up my morning for an a nice brunch.  This is the perfect start! Ordered a spicy bloody and had to walk into the restaurant to personal...",
  "The food and the atmosphere at this restaurant are terrific. They are accommodating with the current circumstances with great patio seating, live music, and...",
  "We've done 2 curbside pickups this month, and got 1/2 of our orders each time. The food is always good, but just take the extra 2min to double check everything.",
  "Very friendly staff that respected covid protocols. Our server checked on us frequently and made sure our drinks were never empty and our food arrived nice...",
  "Very disappointed that they don't practice what they preach, both ladies serving the public where NOT wearing masks even though it says you have...",
  "Excellent business to drop in and get some filling breakfast food at on the drive between LA and Northern California. The strawberry French toast was as...",
  "Absolutely without a doubt you can always count on great food at this location! The people are super friendly and efficient and you're in and out before you...",
  "Great little restaurant. Pretty loud and cheery! Great old school music playing. Family friendly environment. It is definitely more of a place you should...",
  "The rolls are amazing, the husband and wife are super nice. If you go when it's busy you'll be waiting for a while. The food is always good. Wish they had a...",
  "Best sushi place ever! I made a yelp account just to give this place a good review. Super friendly staff taking all safety precautions for COVID. The food...",
  "This is, hands down, one of the best sushi places I have been to! The husband and wife are usually the ones running the place, and everything is made to...",
  "Order through their online app and wow, my food was ready within 10mins! Great choice if you are looking for something to pick up in a hurry! But on the...",
  "So happy I was finally able to try Jacks urban eats! I had heard so many great things about their menu, especially the urban fries and after trying them...",
  "This review is about their To- go service. The fries get soggy in the take out containers. They don't provide napkins or ketchup or spoons in the to-go bags.",
  "There are so far only two reviews of this establishment so I thought I'd add my two cents.\n\nWhile visiting this restaurant for the first time, I found out...",
  "I f ound this a Groupon not knowing I had eaten here last year when I visited the bowling alley, before it was taken over by new owners.\n\nThe food is...",
  "This review is a little biased, my boyfriend and I ate here before they moved to the resturant in the Bowling Alley and loved it. \nWe were in the...",
  "I have eaten here sooo many times I cannot believe I have not written a review yet. Nevertheless, this place is awesome! I find it to be one of the best...",
  "QUARANTINE REVIEW:\n\nStoked on the food. Ordered the saag paneer, chicken tikka masala, and bitter chicken with rice and garlic naan. \n\nSaag was very good....",
  "Their food is always so flavorful, so delicious, cooked perfectly, and plentiful. It's my favorite Indian place in town and I'm so happy that I live nearby...",
  "Cocina Village is one of the places I've missed most during the pandemic. \n\nIt's a good distance from where I live, and it's too far for delivery, so I...",
  "COVID-19 phase: \n\nMy mother called in and ordered 2 Mixto Molcajetes. The worker was nice and said it would be 15 minutes. We went to get it. \n\nThe workers...",
  "First timers for us and what a gem. We will be back. I was looking for a Mexican spot in the area for a quick bite and one where they were serving indoors....",
  "Great coffee,  eggs benedict and chicken burrtio - which we split.  Had a waiter by the name of Nathaniel who was excellent.",
  "Unbelievable.  $400 per night for a room and you can't order breakfast the night before?  \n\nHighly recommend you avoid this Hotel and Restaurant.  Marriott...",
  "The burgers we got were so, so salty. They were almost inedible. The fries were meh. Even the ranch that came with the fries didn't taste great. We also got...",
  "It's important to have a backup restaurant, especially if you're looking for an obscure item like goat stew.  Birria de chivo, actually.  (Now before we...",
  "If you want the taste of the home made food , you have to try this one .\nDelicious u won't regret it",
  "I love this place. It's a little family owned resturant. I go for the carne asada quesadilla. It's so good. It's one of my all time favorite dishes there.",
  "A great place to come for **homemade** Mexican food like Grandma's!  Fast, huge variety, and DELICIOUS. Hubby had a very hearty beef stew (Cocido de res, I...",
  "One of the best Mexican restaurants in town. Its my go to when we have a craving. Burritos, fajitas, arroz con pollo, it doesn't matter, its all good. I've...",
  "Just tried calling again ... the same issue!  NO ONE picks up the phone.  Very frustrating!  \n\nThe food is still good but service is extremely lacking.",
  "The staff is very great. I'm very happy to see they are implementing social distancing while eating inside. Very nice staff and the food was very flavorful.",
  "5 star service! I have been coming here since I was little with my mom when it was La Fonda's. The decor is the same  But that doesn't matter one bit...",
  "Best Mexican restaurant I've dined at hands down! \nMy wife and I make an excuse to go to fashion fair mall coming all the way to Hanford just so we can stop...",
  "Wow! Just wow! Highly impressed with the service and food. If you are near the area or driving by Fresno this is worth the stop. We were driving on the 99...",
  "Just had a chili Verde burrito OMG!!!! Out of this world you have to go ! Outside seating and to go orders, some places have cut corners because of Covid,...",
  "We were passing through town on our way home and we found this place for breakfast. We arrived and they have covered patio seating and they seated us gave...",
  "Despite the pandemic going on, Thai Seasons remains open for take out with masks required and social distancing in effect. A family owned business, the food...",
  "This is my favorite Thai spot because the food is consistently amazing (though I only order chicken pad see ewe because I'm obsessed) and they are super...",
  "Thai season is one of my go to spots for takeout! They are incredibly fast every time I order. Chicken pad see ewe is one of my favorite dishes of any kind...",
  "Very excited to have been introduced to this place by our good friends on Saturday night. Everything was excellent from the food to the service. I'm a...",
  "Food was wonderful, we really enjoy eating there on the patio! Since C-19 we wanted to support this local business and called in our order, the food was...",
  "We ordered two take out taco plates ;one combo fish,chicken asada the second grilled chicken and for lava cake & an order of churros ...\nThe refried beans...",
  "While the resturant is currently take-out only, the food is definately worth the trip. At first the prices looked expensive but one portion of Pho easily...",
  "Always get the #2 pho and spring roll and have never disappointed.  Even there take out is just as generous as portions as there sit down. Highly recommend",
  "Yummy food!!! Best pho!!!! SO DELICIOUS!!! They are very kind people! They all wear there mask correct! BEST PHOOOOOO!!!!",
  "This is a true concierge service. We were up for my husband's birthday, which also happens to fall on Superbowl weekend every single year, so Doorstep...",
  "Hands down the best delivery service I've ever utilized. Friendly owner, wonderful drivers, contact-free everything, and more. I even called asking for...",
  "This little Mammoth company is AMAZING!   We have made two 3 day trips to Mammoth over the past 6 weeks and used doorstop deliveries for each of six nights....",
  "This place is amazing! Food was great! Everything I ordered was full of flavor. The service was great, our waitress Lila was super kind and attentive. Jerry...",
  "Shobu Restaurant was over the top in all aspects of customer service! We got there about 40 minutes before closing and they still provided amazing service....",
  "Been getting take-out from this place on multiple occasions during COVID-19. The food is really good here. Few sushi places serve fresh raw fish like this...",
  "Great and affordable Mediterranean place, the Lebanese chicken is bomb. The salad was also one of the best I've ever had. Try the hummus too, they make it...",
  "This is by far the best Mediterranean food I've ever had in my life! No kidding! It's so good and flavorful. I had the Lebanese chicken plate and it was SO...",
  "My favorite spot for Mediterranean food in Fresno, and worth the drive downtown. The prices are fair and the portions are generous. I crave it at least once...",
  "If you are craving Middle Eastern food, then my friends you have found it at the corner of Blackstone and Shaw Ave in Fresno, California.  The guys behind...",
  "I hate situations like this! \n\nTheir food was excellent. We ordered two plates and a salad for the four of us and that was more than enough food. The...",
  "I'd been wanting to try this place for the longest so I finally came. I have to say  I wasn't super impressed. it was just mediocre. I walked in and was...",
  "Food was good,  not great. Fresno has better to offer for the same price as well a lot less expensive. What made it worse was our server with a bad...",
  "Good food? Check! Good drinks? Check! Friendly service? Check! Ambiance? Check! Local? CHECK! \nTheir Cheese Tortelloni, bread pudding and Waygu Burger are...",
  "*This review is only for a pick-up order during the COVID restrictions.*\n\nCracked Pepper did a great job with the to-go order I placed for my parents for...",
  "We got a nice spot along the creek. It was a quiet and peaceful time. But be sure to bring bug spray as the bugs do come out (more so some days then...",
  "We stayed here last month. Beautiful place and close to Sequoia National Park. The owners were very friendly, no contact check in. The park was relatively...",
  "Our first time at this Rv park. We booked site #22 river view. The site was nice but I think it's the only site with so much sand, just and FYI if you are...",
  "da best around town I love it Dungeness Crab ClustersChipotle CrawfishCajun Seafood. Boiling Crab",
  "By far one of the best crawfish spots I been too, great service with great food , always busy so if u got the patients trust me when I say it's worth it !!!...",
  "We bought our own potatoes, shrimp, & sausage and I boiled them while my husband went to get our pickup order. We ordered 1pound snow crab legs and 2 pounds...",
  "The girls at the front desk on valentine's day were really cool. Rooms were good enough for a budget stay, everything functioned fine",
  "I would have given at least 4 stars except that there was a power outage. Now I know they have no control over things like this but management admitted they...",
  "I'll just start by saying how nice the staff and mgmt are. We'd been driving for hours and the place we'd originally made reservations with screwed up our...",
  "We were walking around and saw this place. We are new in Fresno so we didn't know what to expect. \nWhat a great surprise! \nThe food was amazing! We got the...",
  "Excellent foot. The flavors that they put together just burst in your mouth!  Outdoor dining during Covid is very comfortable. Waiters are very personable...",
  "Best restaurant in Fresno hands down. Drinks are great, the food is great, and the service is fantastic.",
  "Masked worn by workers and required. They have a great lunch menu! \n\nThey have an outside patio with a fan if there is heat. It was very nice! \n\nI told my...",
  "It feels like forever since eating in a restaurant, oh wait it has been a while! Shelter in place lifted so I got gussied up and went to Andiamos. We were...",
  "I LOVE ANDIAMOS! My sister works for a produce company they were her customers. She introduced me to this place and told me it was Authentic Italian food. I...",
  "It has been a minute since I was here but it is such a cute place and such authentic food. I have not been at all during covid so I do not know the hours of...",
  "One of my favorite places to eat in fresno. Delicious enchiladas. I used to dine in once a month before quarantine.",
  "The food is great, the up charge on the menu items due to the pandemic still makes it worth it. It did take me a while to get a hold of someone via phone to...",
  "Just went through the drive-through with my entire family and we had a very complicated order for the kids and the person taking our order was super...",
  "My mom and I were craving a burger for lunch and I thought of Colorado grill as my workplace had ordered a tray from them a few months back and it was...",
  "Why aren't you in Visalia!? Besides being a small town that doesn't deserve you, what is another good reason!? Such an amazing Pastrami Burger from here! I...",
  "Best Nigiri in town! I would also reccomend their Garlic Salmon and Soft Shell Crab Udon. I do like the raw rolls as well. I don't really like sauce'd up...",
  "Saturday, 4/10/2021 - It's been a long time since I went to Yolo. So went to YOLO this past Saturday night for a nice celebration and dinner.\n\nUpon...",
  "My friends and I wanted to have a girls night out here because of their karaoke. I called the day of to make reservations and was asked if I could come in...",
  "I came to Edgar's Italian Restaurant for my males co workers birthday as this is his favorite spot in Madera. We placed our order early so when we get there...",
  "Stopped here for lunch while passing thru. \nIt was a good price my bill was $10.00 and considering that's what Carl's Jr runs for lunch I would say this is...",
  "Delicious,creative Italian food! What a great treat when we visit family In Madera. I had salmon Italian style.",
  "The BF and I took a trip to Fresno over the wknd to visit our cousins and celebrate Mother's day. We found our way over to Spicy J's, which is located in a...",
  "So yummy, very fresh and really nice mouth feel on all of the dishes we've tried. \nDefinitely a go-to to-go for us. \nPlus, they care about COVID and masks...",
  "Taking a step back from the common \"Chinese\" dishes Spicy J's brings the flavor of the Szechuan kitchen to Fresno diners. With their unique and classic...",
  "I love this restaurant. My wife and I have been going there for over forty years. We really enjoy ourselves and our meals when we go. We always get the...",
  "(During Covid)\n\nI lived in Fresno for a long time and have always heard about Richard's Prime Rib and Seafood.  Why did I wait this long?  Definitely a...",
  "Covid-19 Phase: \n\nThe worker was very nice. My mother called in and ordered the Something Good, medium rare,  with no mayo and add jalapeños. It is supposed...",
  "So glad to have found this restaurant in Fresno! I know with Ethiopian or Kenyan food I will always find a good selection of vegetarian dishes.\n\nThey do a...",
  "My fiancé and I wanted to try this place for a while and finally did. We arrived around 5:30pm Saturday evening they only currently have take-out. You can...",
  "I dont know why it took me so long to write this review but here it is. Fasika is delicious and a must try. We been here a couple of times before the COVID...",
  "We have been coming here for years, and finally getting around to giving them the 5 star review they deserve. \nAlway pleasant, food is always prepared on...",
  "Very disgusting worst walnut shrimp I have ever had. And all my boyfriends food tasted disgusting as well. Ordered on DoorDash but I need to give a review...",
  "Started eating here when I moved to this area. Loyal customer etc, they messed my order up by giving me the wrong item. I called back to advise them it was...",
  "This place deserves all their 5 star ratings on their food alone. It's very very good. Thai food is one of my favorite go to types of food to eat. I love...",
  "Because of the hours, we kinda forgot about this place but with COVID, we've been trying to support local restaurants and re-stumbled upon this place again...",
  "I HATE that I compare EVERY place to Pad Thai, but I just can't help it...their food is THE BEST in Fresno/Clovis. \n\nI don't remember if Pad Thai was...",
  "I was nervous about an online order because we needed to get on the road.  The food looked good and I was not disappointed.  Our lunch was very good and it...",
  "This was my second time coming to the Lazy Dog located in river park it's pretty nice area. They have a sign saying 90 minute seating only due to covid....",
  "First Impressions: Arrived and was greeted by the host with a smile. The host had extra masks available for customers, and everybody waiting was spaced out...",
  "I missed Red Apple soooo much this past year.\n\nPre-pandemic, I used to come here at least a couple of times a month. The service is always friendly and the...",
  "I love this place for breakfast. The food is always great and so is the service. I missed it during the COVID panic. But I went back the other day with some...",
  "Huge portions. Delicious food.  Friendly and efficient service.  Staff wearing masks.  Tables are socially distant.   Covered outdoor patio seating...",
  "Stayed here for a quick getaway to Yosemite and was pleasantly surprised at how nice it was! Booked via their website, which actually turned out to be the...",
  "we had a great experience; dog friendly (+$50/2nt i think? don't quote me)\n\nespecially during pandemic this hotel will be good because the doors and windows...",
  "Easy check in, nice buildings, and great views! We stayed on the second floor at one of the buildings up on the hill. Had a gorgeous view of the sunrise...",
  "We tried the little gem on New Year's Eve for take out and we were not disappointed. The food was great and they definitely give you plenty of servings for...",
  "Intimate, well appointed dining room in a strip mall shopping center. Menu offers a good selection. Food is very well done. \n\nUPDATE:  During the COVID-19...",
  "We love Jimy Wen's.  I love everything I have tried.  I especially love the orange chicken, cashew chicken and the egg foo yung.  So thankful they are open...",
  "We stayed at this hotel Feb 22-24 and I am giving 4 stars because of great customer service especially Mark at Front desk who had been very helpful. We had...",
  "I'm giving this place 4 stars because with Covid they really are doing best they can to provide an excellent stay. My only gripe: The pipes and floors are...",
  "I was a bit apprehensive booking since this is only rated 3 stars on Yelp.\n\nI don't agree with it being this low. Sure, you could pay less for a similar...",
  "This place was recommended by a friend. I called just before 8am and placed my order. The young lady was pleasant and ahold me it would be ready in 10...",
  "THE BEST SERVICE I've ever got!!!! \nErnie has to be the best hands down, recommended a delicious beer and even let us sit and eat when they were about to...",
  "Takeout review:\nI really was not impressed with this pizza. The crust was like cardboard and the toppings never settled into the crust. When I eat pizza I...",
  "What a great find! Stayed for one night on our way into Yosemite Valley. Friendly and accommodating staff. Easy check in and access to our room. Parking was...",
  "Super cute, rustic, and quaint inn that is pet friendly and incredibly close to Yosemite National Park. Our room was clean and tidy, right out window...",
  "Great place! We were planning to attend an in-person conference in Tenaya. We also had reservations here at Narrow Gauge Inn. Covid cancelled the...",
  "Nothing too good to rave about. Got a handful of different things to try food was good nothing that would make me come back michelada was good on the spicy...",
  "I'm really not sure why this place is getting so many bad reviews.  We have been there a few times and the food is always amazing.  I did take away a star...",
  "After a day of running errands my kids and I wanted to try a new Mexican place. So we went onto Grubhub to look for a place to pickup a meal. We found this...",
  "At first sight you're like oh no it's in a strip mall... but once you go inside you're like wow this is a nice place! We chose to eat outside, the back...",
  "I had been wanting to try this place out since it first opened its doors. I just got a promotion at work and my wife surprised me with a mini celebration...",
  "SO GOOD! First of all, the tables were pretty well distanced for covid safety but also gave added feel of privacy/intimacy. The decor makes you feel like...",
  "I stopped in for a couple of quick appetizers to nosh on and I am glad I did. This place is clean, service is friendly, food was good. I ordered vegetable...",
  "This place is absolute garbage. I can't believe that the bahn mi they serve people. It's disgusting and literally tasted like soap. I ordered 2 sandwiches...",
  "As avid fans of pho from the Bay Area, we really wanted to like this place. The front staff was attentive however that's about the only positive of our...",
  "Wahoo!! Our neighborhood bar is OPEN for dine in!!  My husband and I went for dinner and it was wonderful!! I had a side salad that was so fresh with...",
  "This is one of the few places in Fresno that I've come to see as something like my favorite local pub. It's a great bar with a quiet, relaxed vibe - ideal...",
  "Love the cozy neighborhood feel of Little Leaf Bar. Went there for the food, which is next level bar food. Started w/some deliciously delicate fries and the...",
  "Covid-19 \n\nThe worker was very nice. My mother ordered their Huevas a la Mexicano with grilled ham, extra veggies and light on the oil. She also said egg...",
  "Our last visit here was in May, so not sure if they're open right now. Hopefully, they are still doing to-go during COVID chaos and I hope they are able to...",
  "ALS Cafe! This is definitely a Favorite for me as a local breakfast spot for Fresno. You can have a wholesome breakfast my favorite, 2 eggs, 2 bacon slices...",
  "I LOVE THIS PLACE!!! Been going here for 30 years and the standing joke with my family is that I have taken 50 first dates here, though I do love walking in...",
  "Ordered take out from them and they answered so quickly and took our order. We ordered orange chicken, crispy beef, Tsing Tao fried rice and egg flower...",
  "I had a chance to order take out when I was visiting my family for the Holidays and was plesantly suprised when I ordered from Tising Tao. Oh man there was...",
  "My mom called to order their 2 meat meal for us to split. A togo order. Barbecue chicken and riblets w/ macaroni and cheese and red potatoes. Spicy bbq...",
  "Indoor seating available including at the bar. A few IPA's on draft which is good.  Cajun Chicken Sandwich was excellent. The bartender even brought us...",
  "I ordered the family feast and a extra side order of mashed potatoes. I did the curb side service and went to pick it up. \n\nThe EE brought out my food and I...",
  "I wish I was better at cooking Laotian food, but thank goodness for places like Lao Cafe 2. I love supporting small businesses and local places and this...",
  "Absolutely  the best. I compare everyone else to them. Food is authentic and very flavorful. My faves include, Geng Phet,  chicken Pho, Nom Tok Thai Style....",
  "This was our first time here and wow! Service and food was bomb! \n\nOur server was very friendly and was talking to us like we knew each other! She made us...",
  "My go-to Chinese takeout place in Fresno. They have indoor dining as well normally but during COVID times, just take out! Affordable prices for delicious...",
  "This is our 8th try trying to find a delicious \nChinese food place and this is it. Ordered through door dash the delivery was fast and the food was...",
  "My family's go to Chinese restaurant. The food is delicious and made with love. There is very little wait time. We call online and it is ready for pickup in...",
  "Top notch restaurant. Went here on the recommendation of a friend of ours who eats here all the time. We went for dinner. The restaurant is clean, all Covid...",
  "This is one of my favorite restaurants in town but I haven't been here in the last year and a half. \n\nI made a reservation for seven people and we were late...",
  "This was my first time dining here and I really enjoyed my experience. I loved that we could make reservations too which is what I did. Even though it was...",
  "I find it interesting how these chain restaurants have 2 star ratings. It makes me want to stay away but hubby and I decided to give Red Robin a try....",
  "Came here one other time and place was mobbed. Not today. Unsure when dinning opened, but glad it is. They are on top of things here! Bottomless fries began...",
  "They handle take-out wonderfully. Easy to order online, easy to pick-up, time efficient, and order is correct. Definitely recommend and will come back for...",
  "It's been awhile since I dined in at Tamari. My husband and I decided we fancied some high-end sushi to-go, so we made a takeout order on a Saturday...",
  "The food was excellent. The drinks were great. Service was unfortunately slow and they forget an appetizer and drink. We'll definitely be back for the food...",
  "Came here for a friend's birthday, we got the mystery roll which is super interesting and delicious. we wanted to try the yakitori but sadly due to the...",
  "Ever since I can remember, I have eaten food prepared by this chef. He is by far the freshest, most polite, and most delicious prepared food chef that I...",
  "Gotten sloppier...not putting any effort anymore.  We are regulars, but since they have started telling they are going to retire and close their restaurant...",
  "Whether you pick up or have it delivered, this little hidden restaurant is worth the time and parking trouble to get to.  It's not much to look at and the...",
  "When I order out for delivery- Tofas is my go to place! Love the chicken and the hummus",
  "This was great it's hot outside we didn't wait long. We were able to grab a booth. It's a clean restaurant the bathroom is clean and the food was good....",
  "Horrible Service! \nI would give there food a 3 stars it is average, except the chicken shawarma is very greasy. I ordered from there a couple days ago and...",
  "Best burger and fries in Fresno. Old school burger with fresh lettuce, tomato, pickle and onion. Fries are hot and delicious. Milkshakes are thick and...",
  "Covid-19 phase \n\nTook the drive-thru. The line moved quickly. I ordered a grilled chicken sandwich w/ jalapeños, cheese and avocado added. Also, no mayo or...",
  "Fancy burger is a hidden gem when it comes to burger places. Their food is always hot and fresh. Not your typical drive thru. You'll have to wait a tad bit...",
  "I Found another neighborhood first rate authentic Mexican Resturant today!!\nI  had the albondigas soup & asada tacos...ingredients were fresh favorable\nand...",
  "They're open for indoor dining and are meticulously following safety protocols for staff and customers.  Tables are well separated and employees remain...",
  "Cocido  was very good and tasty ,service was good,quick. Take out was easy and order was correct. Will try again",
  "Seriously the most amazing place ever. Can I move in?\n\nWe came the last weekend of August. We were nervous with the fires, but when we called, the staff was...",
  "What an Incredible place! \nReally enjoying our stay here and all aspects of the room - cleanliness, warmth, comfort, amenities (hot water kettle, coffee,...",
  "A hidden gem! Exactly what I needed this summer. Was a little nervous given COVID, but Evergreen went above and beyond. Lots of outdoor seating. Huge pool...",
  "Our go to for bomb breakfast burritos.  The place is small but the food is good. We usually do pick up.",
  "This is our favorite Mexican food in town, been coming here for about 25 years.  With the lock down they are still making quality food to go.  Our son grew...",
  "I'm not a big fan of Mexican food and passed by this spot with my family but, wow. This place's burritos, nachos, and chalupas have such an amazing flavor....",
  "This was without a doubt one of the nicest hotels I've stayed in lately.\nFrom the check-in to the huge and clean rooms and the large balconies you can't go...",
  "I love this hotel! Right next to my work and all rooms have an adorable patio attached. So nice to have the door open and sit out there. Room is always...",
  "Thank you so much are stay was one of the best nice clean rooms staff was so nice and helpful no problems at all will definitely be staying there again and...",
  "With all the surrounding competitors, it has become easy to put this place on the back burner to get your taco fix. Tacos Tijuana has and will always be one...",
  "It's a bad place, you ask her for a dish and they give you a very different one, the waitress is very daring, the cooks stare at you while they eat and they...",
  "Visiting in town and honestly this is the worst service I w received from anywhere. Told me they were closed when people were clearly sitting inside and...",
  "This cozy restaurant has left the best impressions! Hospitable hosts, delicious dishes, beautiful presentation, wide wine list and wonderful dessert. The...",
  "I finally stopped to try this place out since I have been wanting to support 'mom and pop' restaurants. I was not disappointed. Their food was superb!  The...",
  "Their pasta and salads are excellent! I highly recommend! I'm not sure what their status is during COVID-19.",
  "Food was good, chicken was perfect, rice was soft. Prices are alittle pricey but overall very good only waited 8 min for my food. Would recommend",
  "Long story short food is great, but Yelp is lame and wants me to write a review just to give a rating.",
  "Was stoked to revisit this ol' high school gem.\nI don't know WTH happened but it doesn't come close to what it used to. I've had better food in prison!",
  "We ordered delivery from Ming's tonight.  It has been more than 30 years since I last ate here and I'm sorry I haven't returned.  It's a great little...",
  "Wow! I am a big Chinese food fan, but haven't had it in a while because all the places I have tried in Fresno have been pretty lackluster. I had a...",
  "Wonderful staff that is friendly and helpful. I always come for the Ming's special chow mein and to see what their current specials are. It's quite a drive...",
  "I've been getting recommendations for Gem of Thailand for at least 4 years, but never had a chance to try it. \n\nFinally, recently, my husband and I fancied...",
  "My husband and I are regulars here. Last Friday, we dropped by for our weekly take-out order and found out that ownership changed. Although the food did...",
  "Birthday dinner my BF picked up for me tonight. Gem of Thailand has been my favorite place for years. The owner lady is super duper nice and pleasant. Food...",
  "A very nice place to have dinner or lunch with the people you care about a very interactive experience that keeps phones out of everyone's hands and instead...",
  "First time coming and it was very enjoyable and will definitely come again! Monday around 5pm the wait was 5 minutes but I was pretty busy in there. Since...",
  "My sister recently treated the family for lunch at J Pot Mini Hot Pot & Bar in Fresno, California.\n\nLocated inside the River Park Shopping Center, my sister...",
  "First of all, The food here is what my kids crave.  When given a choice of any food for a date with dad, they all choose this place or China Restaurant....",
  "This is a great place to get takeout. The food is good and the service is excellent. Friendly staff who follow COVID-19 protocols. I have them on speed dial.",
  "Food was great! It was actually way better then I can remember from years back. Everything was packaged nicely and I was able to take it home without having...",
  "Went here twice during my week work trip. I enjoyed both times. Food was good, drinks were great, service on point. \n\nWe had a Moscow mule, some blue drink,...",
  "We've ordered from them for home delivery twice now and we were pleased both times.  We didn't stray from our favorite, the prime rib.  The meat is juicy,...",
  "Appetizers, entrees and drinks were amazing. The server was also our bartender. I believe his name was Danny. Extremely friendly folks from the time you...",
  "24 years we have been eating there and never have they failed to deliver good food and service, except this time today I walked in and no one was behind...",
  "*chips and salsa are awesome, award winning, and free (unless you want more than two free rounds of chips and salsa)\n*the house margaritas are really good....",
  "I remember the food being much tastier. I guess we can blame Covid for this... I hadn't been in since last year. The service was fine but the food was...",
  "Covid compliant with masks, seating and hand sanitizer. Very nice employees. Hostess Alyssa H. was highly attentive and I wished she was my server. Food...",
  "Food is good, people are nice.  New hours for covid, but at least they've got a very comfy patio.  Posted picture of patio hours.  Know before you go.",
  "Great food! My hubby and I got the chili burger and fries and I got the buffalo wrap and curly fries. It was delicious and large portions, friendly service....",
  "Great Fast and healthy Mexican seafood. They have chicken, asada, or fish/shrimp tacos, burritos, or bowls!! Great patio for lunch on a nice day. Campus...",
  "Time for an update. I have been coming here for roughly two years. I always get the same thing: Shrimp Tacos. I have had other items in the past and all are...",
  "Omg I feel so horrible that I have forgotten to update my review on this particular location! I have returned like 20 times if not more since my last review...",
  "Noodle Q is located on the corner of Ashlan and Fresno and is by far, one of my favorite places to eat in Fresno when I'm craving homey Chinese food.\n\nI've...",
  "I ordered through UberEats (or another delivery service) and LOVED their broth. Without having gone in I can't say anything about their service or the...",
  "Fantastic! Great food, quick service, and very accommodating for our party of 11. I am on the paleo diet, which meant I couldn't not enjoy their noodles or...",
  "I love their hummus probably the best in town , tastes fresh and homemade , it's so creamy and tasty. Too bad it comes in such a tiny little container ,...",
  "I've eaten here quite a few times. I always order my food to go. So I'm not sure how good there service is dine in. But the food is great. My whole family...",
  "(During Covid)\n\nGood food.  Very attentive staff.   This restaurant is located in the Northeast corner of Cedar and Nees.  It has outside seating and a...",
  "Friendly staff and the food was well portioned at a budget friendly price.  \nI tried the stuffed peppers and it was portioned large enough for 2 meals.  The...",
  "Great take out meal! I appreciate that the staff blocked off part of the restaurant and appropriately sanitized/wiped down the pen that I had to sign with....",
  "4/8 at 8pm. \nThank you to the whole staff at Papi's  for making take out tonight so delicious. It Always is but we were really looking forward to it and...",
  "Their Wet carne asada burrito is amazing!!! The staff is great and they do a great job with social distancing.",
  "Love the food! Delicious! Good price! Love this place. We take out every week. Awesome burritos and tacos. Especially during COVID, their service and...",
  "I ordered asada tacos for my lunch and the food was prepared before I got there, the cashier was extremely friendly & my food was still hot when I picked it...",
  "We are visiting from Orange County and my husband is here working for a month. We decided it's Olive Garden kind of night so we went. Due to COVID, their...",
  "Covid-19 Phase:\n\nYou have to order 25 minutes before you pick up. \n\nMy mother ordered their shrimp scampi with salad and breadsticks and an extra side...",
  "Ok, this was Awesome!! Food was in point and Plentiful!! Staff was Covid Cautious but so friendly and helpful!! You did great Olive Garden on Clovis and...",
  "Best old fashioned burger joint in the Tower/Downtown area. Huge burgers, the best fries and great service. Can't say enough good things about this place....",
  "Good experience! The pictures of the food looked really good! The worker was very nice! Easy to talk to! Asked what was most popular. Told the chicken...",
  "I went in ordered a grilled ham and cheese with jalapeños (the only thing ive ever ordered) \nFirst of all i asked for hot sauce got an ugly attitude and an...",
  "I am so happy to eat out at a buffet again only bad thing now it's more pricey almost 20 dollars for lunch on Saturdays.",
  "You can probably blame covid for this but this is my experience, I miss buffet and just wanted to have a dine in experience, it's 15 dollars a person for...",
  "My family and I came here for a very late dinner as a result of being delayed from our Lake Tahoe trip, which was arranged by a tour guide and travel...",
  "Old Town Clovis is country.  The name of this cafe is country.  And the food, well, it's authentic country.\n\nI should know.  I grew up in the Valley, so I...",
  "Are you those types of people who can't pass on good ole fashion diners? Yeah, me too. I couldn't pass up on the chance to check out this cute diner. \n\nI...",
  "Took my kids here. They loved it and the chocolate milk boots were a winner. Best biscuits and gravy in town",
  "Ordered thru grubhub for pickup. Food was excellent. Asada fries were tasty, the fresh serano chile slices add a little extra flavor. Asada burrito was...",
  "Food is delicious and served HOT and fresh! Outstanding chili relents and the chimichanga is the best! Would give five stars except for the slow service....",
  "I came here with my family for the first time and we had probably the worst experience I've had in awhile. \n\nShe was pregnant and apparently used that as an...",
  "Love this place, it has quickly become our go to for Chinese take out. Fresh vegetables, great flavors and not heavy on the oil. Always happy with our...",
  "Very pleasantly surprised by this place. It's not much to look at when you first walk in and the quarantine decor didn't help, but the food was well priced...",
  "Got the vegetable chop suey. Fresh and delicious, noodles were great. Portion was big, enough for 3 people. Definitely worth the money. We just ordered to go.",
  "We were happy with our large comfortable clean room with a nice view. We had a microwave, stove, fridge, freezer, coffee maker, hairdryer and heater, all...",
  "Great place to stay! Clean Lobby and store\nStayed at the River View Room. 2nd floor has a nice view of the entire river. 1st floor has bigger balcony for...",
  "During COVID, we stayed here for a couple nights in the Maple building and it was a cozy stay. The lodge was about a 30 min drive to Yosemite's park...",
  "Amazing Pizza, Don't go anywhere else for Pizza if you're in Mammoth. They have the best thin crust pizza I've ever had, and their from scratch Caesar salad...",
  "Pizza was delicious! We got a hawaiian and pepperoni pizza. We ordered the food to go so we could relax in our room. We used the bathrooms and they are...",
  "We ordered take out while staying in mammoth. The food was decent,overall sort of meh. Pizza dough was bread like, but ingredients seemed overall okay. Not...",
  "Right now, they're only open for take-out....BUT....I think we just found our new favorite Chinese food place !! \nFood is great and very generous portions. !!",
  "I always enjoy getting takeout at Great Wall, this is our go to local spot for Chinese food. Their food is always great with large portions. We normally get...",
  "Great Wall Chinese Cuisine wil reopens tomorrow.\nWelcome!",
  "We had a family lunch here on Saturday and it was such a lovely time, that I didn't think to take any pictures of the food. We had a party of 5 (all fully...",
  "Thanks to all the staff at Sals. Today was the first indoor dining since the plague began. Service and food were both first class. I will be back. THANK YOU!",
  "I like Sal's. I've been here a few times since COVID and they do offer some outdoor seating. Their food is good, tasty. I enjoy their chips, salsa,...",
  "Honestly, I was a bit hesitant about this place...\n\nWhen I think of good Mexican food in Fresno, I think of Lily's, Country Fare, Don Pepe's, La...",
  "This Mexican girl who grew up on Gma's authentic Mex food has found a new fave Mex restaurant in Fresno. Even better: it's owned and operated by a local...",
  "3-Stars ?? -- I don't think so.  I liked this restaurant on a number of levels.  \n\n1. Prices -- so reasonable \n2. Service -- staff was incredibly friendly,...",
  "Great food, must stop by on your way back from Yosemite or any proper outdoor adventure. Love that their beers are named after the peaks we love to...",
  "We had a great birthday. Ordered medium done burger came out done. But Alex made the night if it wasn't for him it would have been mediocre.",
  "This place should have 5 stars because the food is actually really good and the customer service is to match! Natasha was our waitress and she put in our...",
  "B S Coffee Shop is always amazing as are the biscuits and gravy. Order it with half sausage and half bacon! Service is fast, staff is nice, food is great,...",
  "Great food super friendly staff always walking around to take care of you their food is amazing wether you choose breakfast such as a tasty chicken fried...",
  "I reviewed this place right after the new owners took over . I wasn't real happy as I was a long time customer of the OLD BS and the new place didn't...",
  "First time coming to Dog House Grill as it was recommended by a friend. It did not disappoint, the tri-tip sandwich was best I ever had as it was both...",
  "Yes they bbq and bbq is great but they are overpriced. All the beans and dishes are drenched in FRUCTOSE BBQ sauce. Makes my stomach hurt. Not the...",
  "COVID-19 phase: \n\nMy mother called in the order and talked to Taylor who was very nice. She ordered the Dog House salad. Large and added grilled chicken and...",
  "At first glance, I thought great another Chinese buffet. Upon entering, I was greeted with cheery staff who happily explained how things worked and later...",
  "Lin's Fusion amid all the pandemic shutdowns has reopened for outdoor dining in their patio! Unlike the usual buffet experience the food is served by the...",
  "Family's Fav buffet. Crab legs are gone due to covid but the rest of the selection is good. Crawfish ALWAYS large and seasoned to perfection. 10 out of 10...",
  "Nice old school bar. It was almost empty when I went in. The  bartender was nice and easy to talk to. Took them up on the free drink  special. \n\nOrdered the...",
  "I'm reviewing The Downtown Club on their happy hour. Based on my experience at HH, I eagerly await coming for lunch or brunch. I've stopped by for HH a few...",
  "This place is located in a fairly dead area. I came on a Sunday for their brunch with a big group of friends. \n\nThe inside of the building is beautiful with...",
  "I went too Pokiland right before the pandemic in 2020.. I meant too right a review but I never got too it, we recently got Pokiland for takeout and it was...",
  "Came here for our first time during COVID to get my craving for a Salmon Poki bowl satisfied, the place was clean we didn't have to wait long in line before...",
  "Love, love, love me some Poki!  Staff is always friendly and helpful.  Food is fresh and filling.  I love getting the medium chicken teriyaki bowl with all...",
  "COVID-19 Phase: \n\nI went with my mother to pick up lunch. You are allowed to sit inside. My mother ordered two chicken kebab sandwiches with salad instead...",
  "My family has been going to this restaurant for many years.  We have never been disappointed by the quality and quantity of the food.  I am never able to...",
  "Such a classic. So happy it's been able to survive this last year. I enjoy the breakfast here. The French toast is to die for!! And obv the shish and eggs...",
  "Many people we know love this place.  It was a stay-at-home-together day so we started looking at Uber Eats, where we've been trying to use a discount we've...",
  "First time ordering takeout here and the Service was quick and easy. I had order roast duck that was cold. Although it tastes good the duck was just cold...",
  "This place is the best! Big, filling portions that I've yet to find anywhere else. The customer service is ok, but because of all the orders, it's...",
  "Oh My Gawd. How did this place get so many positive reviews. Where do I start? I was worried about leaving my car, there is a lot of graffiti and garbage...",
  "I went out to eat alone and was nervous going to a place I never been before but arriving they were very welcoming and fast to seat me. It's a small place,...",
  "Food meant to be served hot was warm at most. Service was mediocre but has lots of space for improvement. The food variety is pretty low. The sushi was good...",
  "The best Chinese cuisine in town!  Huge portions at a fair price.  The service is always great, just be sure to leave yourself enough time for take out,...",
  "What can be said about Shanghai that hasn't already been said many times? There's a reason this place has thrived over the past 20 some odd years. Not only...",
  "We ordered the dinner special#3  and it was very hot, n fresh.  The spareribs, and sliced bbq pork were flavorful and not dried out, and the egg roll was...",
  "COVID-19 Phase: \n\nPlaces were closed so I went hunting and found this place. I called in the order and the worker was very nice. I ordered a chicken...",
  "For how small of a place this was I was really surprised how good it was. Great for take out and dine in but designed more for take out. I would go back...",
  "Everything there at the menu it's super delicious I usually get this play it's number 36 and it is super delicious and fulling and also I get shrimp tempura...",
  "As I was walking in to get my take out orders and saw the people that was eating there and how big their bowl was, I realized that I had ordered too much...",
  "I called in the order. The worker was very nice! I ordered the fire chicken plate and substituted fried rice with chow menu. The worker said it would be 30...",
  "Such good, quality food with huge portions. I can never finish my beef bulgogi plate and have to save it for dinner. Pre-covid, the shop would get very busy...",
  "I had the pleasure of staying at the comfort suites in Fresno, during a BPOE (ELKS) convention.. I was the sergeant at arms for the newly appointed...",
  "When we first checked it me and my fiancé felt we didn't get a warm welcome when we checked in the lady with the glasses didn't even say hi or welcome she...",
  "False advertisement on having a pool. I just booked a room a few nights ago for today and I call ahead to double check if their pool is open and they say...",
  "Went into Salsa's by mistake and are glad we did thought it was Bobby Salazar's. Service was good and the food was great. Will go there next time we are in town",
  "Excellent food and beautiful casual elegant atmosphere,  a real gem. You won't be disappointed",
  "They are open during COVID. They put the menus under the glass at the tables. We went here cause we really wanted Mexican food but Bobby Salazar's was...",
  "Cute little bakery with fresh, organic baked goods.  Cookies, brownies, cake/pie in jars. Bought a little of each.  The bag of chocolate chip cookies were...",
  "Came here for ice cream. The vegan cherry ice cream was amazing and so was the berry pie. Knocking off 1 star for lack of COVID measures being taken by...",
  "We ordered to go with COVID challenges ongoing. Excellent safe pick up or delivery options. The chicken and veggie pot pies were tasty comfort food. Plus...",
  "One of the best taco places in Fresno! The place is pretty small and I swear they are always busy, so either go early if you want to dine in or call in for...",
  "By far best place for tacos in the valley! Birria is amazing as well great variety of all things needed for take out soup.",
  "If you haven't tried their tacos you're truly missing out the line may be out the door but it's because they're just that delicious you can dine at...",
  "This is a surprising little place.  It's very much a fast food take-out sort of place, although pre-Covid, they did have tables.  The food, however, is...",
  "I was truly impressed and satisfied with the quality of the sushi I got with my party tray. My sister's birthday is on Christmas Eve, so this year she got...",
  "Excellent sushi quality! We get to-go all the time, pre-covid and now, quality is still great! Our go-to rolls are the red dragon, spicy tuna with avocado...",
  "COVID-19  phase: \n\nMy mother called and asked for recommendation and took what was recommended. The chicken tikka masala with rice and naan and veggie...",
  "Royal Taj has a new chef and the butter chicken and goat korma were out of this world. Hands down best I've ever had. They did a great job of adhering to...",
  "I decided to try a Indian food restaurant by my house for dinner. They had good reviews so I decided to order take out. I ordered chicken tikka masala,...",
  "Delicious pho a a decent price! The staff is always quick and polite as well! They have were great at making pho before COVID, and made it easy to do pick...",
  "Honestly this place doesn't get the credit it deserves! I ordered a large rare steak & brisket pho & it was a pretty decent size. The broth has good flavor...",
  "The food here is delicious. It tasted clean, not heavy. You can order at the door and take it to go. Service is quick and friendly.",
  "I thought the food was very good. We ordered for the first time ever, and because it was New Years Eve I wasn't expecting a lot! The pick up process was a...",
  "This is a a amazing Chinese restaurant.  Even during the pandemic they have been so courteous and kind, servicing their clientele!  I love their won-ton...",
  "Love this spot. The dim sum of course is the star of the show. Can't wait until we can enjoy a nice sit down meal with the family instead of take out. Soon...",
  "My wife and I didn't have the kids the other night and she wanted too do a date night! She LOVES Chili's! So we picked up a movie & picked up Chili's...",
  "I stopped super late, almost closing time and they had my food out to us in a quick fashion and did not mess up anything. Covid has made everything weird...",
  "This review gets 3 starts for effort because the food deserves one. I had a 25$ gift card so I thought I would use it especially during a covid pandemic Im...",
  "Let me start off by saying we were gifted a night here for my husbands birthday. We come to Yosemite often, and are grateful for any opportunity to stay in...",
  "This hotel is old and magnificently beautiful. Queen Elizabeth stayed here during her North America tour. During covid there is no reservation needed. We...",
  "This is a top notch hotel - right up there with Ritz Carlton, St. Regis and other top brands. The service was much better than any other hotel in the state...",
  "Walking throughout downtown Fresno has been such a beautiful experience. I've been running into cute restaurants and Los Panchos is another one of them....",
  "Panchos has great customer service and great potential. However, I feel like they are missing advertising. I didn't come here because of advertising.  Found...",
  "How do I know if a Mexican restaurant is authentic? I ask one simple question. \"Do you make your own tortillas?\" If the answer is NO, I'm a little...",
  "The dude and I came to Hacienda Tequila on 7/23/20. We came in about 30 minutes before closing.\n\nWhen we entered there was a couple eating on the patio...",
  "We thought this restaurant closed because 559 Tacos was in their location BUT they simply moved to a bigger place. So we haven't been here in about a yrs if...",
  "I can't wait to actually sit down and enjoy a meal here. We ordered takeout during the shelter and place. It was delicious!! So I can only imagine how the...",
  "We were in Fresno because I don't even know.  I wanted to hit the Shepherd's Inn, but they were closed.   When I typed in Basque, this place popped up.  We...",
  "Great service, lovely people!!  We ordered Christmas supper as takeout, prepped and ready to heat in the oven the next day!!  Everything from appetizers to...",
  "Go for the chicken livers. Stay for everything else! Great food. Great bar. Great people. Great place!! Seriously, get the chicken livers!!!",
  "Took the drive through. The worker was very nice. \n\nOrdered the chicken black bean bowl. \n\nIt came fast and was an easy experience.\n\nAlso ordered extra...",
  "DISSAPOINTED!\nI have been a loyal customer of El pollo Loco for years.  Tonight the manager tried charging me a dollar eight for two cilantro salsa. She...",
  "Service took a long time... our chicken was burnt and most our pieces were wings, no variety. They were out of rice and guacamole and chips but they were...",
  "I eat this today for a late afternoon lunch and it was absolutely amazing. If you do decide to get the chicken Katsu plate I highly recommend just getting...",
  "Every time I visit Fresno, I stop here. Hands down my fav place for teriyaki with huge portions and unbeatable prices. Great customer service too!",
  "Favorite spot for a teriyaki bowl, they're quick and don't skimp on the protein in your bowl. Their beef bowl is a thicker steak not a thin sliced beef and...",
  "Wanted to write a review on a past take out experience.  Really appreciate Dave for making things right.  Service has always been good here.  Definitely...",
  "We had lunch here. The food was good. The chicken and tri tip could have definitely used sauce. So we asked for some and it was good. The teppanyaki was...",
  "My only 2 complaints; (1) I didn't order more hot and spicy sauce; (2) I didn't order the side of mushrooms I was contemplating when ordering.\n\nI downloaded...",
  "This place is the real deal. High quality food with high quality flavor! Their chicken tikka masala, garlic naan, and basmati rice make for an amazing meal!...",
  "I just went there just as I was going into Ashlan from the freeway & decided to try it! This was on Tuesday, April 6!  First of all the waitress was...",
  "Bam! Ordered from India's Oven last night and we were not disappointed. We had the Malai Kofta, Chicken Pataya, garlic naan, and a side order of rice. All...",
  "In fresno, it is hard to find korean food restaurant. \nKaya is one option.\nReasonable price and many kind of Korean foods are served.\nQuality is good but...",
  "My son and I arrived at the restaurant and when we came in it looked busy with a lot of customers. We stood and waited for a table and waited over 10...",
  "Literally had the same issues as everyone else. Someone could probably sue this place for being discriminatory.",
  "The hotel and staff are super nice. But I will warn out of towners. The area is super sketchy. If you are being cautious at night then you are good! I...",
  "The reservation that I I set up for my mother was set up wrong by clerk and after showing the physical evidence of the mistake made the manager was very...",
  "The location is in a relatively quiet part of downtown Fresno. I only stayed one night on a business trip and it didn't go so well. The room was clean for...",
  "It was AMAZING It is so hard to find true Vietnamese food that does not taste like take out but true cooking ! Everything was so fresh !!! I order in...",
  "I got their BEEFY Ox tail XL pho because I wanted all the meats!  The broth is rich in flavor and so yummy!  I usually eat a SM pho but I couldn't resist...",
  "Service was good. However, when going up to pay, they were gonna charge me for something different. I told them a few times that we didn't order what they...",
  "Hear ye, hear ye! They offer BOTH Pepsi and Coca Cola. The soft drinks are served in cans along with glasses of ice. The combination plates come with both...",
  "Please support our small businesses. This is the first time I've been to a restaurant to eat indoors since the pandemic. There were not many people inside...",
  "Keep your deep fried sushi, booty booty rolls, and spicy mayonnaise sauces to yourself. You won't find any of that garbage here and that's what makes Kijima...",
  "Great food and lots of options. The only time masks are not required is if you are at your table. Had a nice dinner with 5 people.",
  "This place was insanely good! We had read some bad reviews and were surprised how wrong they all were! The food was fresh and delicious and everything was...",
  "Ate there last week. The only hot food that was hot was the soup. Looked like a restaurant that had just reopened, so I will cut them some slack. \n\nMy lunch...",
  "I haven't been to this Arsenios for awhile since they always screw up or the taste and quality wasn't the same. Tonight is a different story I want to say...",
  "Workers were messing around had to repeat my order four times and it was still incorrect. Had asked the worker what was going on and she just laugh. This...",
  "This spot has great service and food I got some asada fires with shrimp super delicious I'm super satisfied will be coming back again love it",
  "Great chicken mole. Chicken was a little lacking in quantity of meat. But it was more than made up for with the mole flavor,  beans, and rice. Overall a 7...",
  "As of Sept 27, they are open for dine in and takeout. They had their tables spread out and everyone wore masks on their way to get seated, then removed them...",
  "The food is amazing!  Ruby has provided great service she's great.  We'll come back for sure. Bring your family down to enjoy the patio, it's shared and cool.",
  "You get what you pay for at this momo.\nIt's been years since I've seen roaches but recognized them immediately when they came out from behind the...",
  "Do not stay here unless it is a last resort. I'm not from Fresno so I didn't realize this place is in a bad part of town. \nThe outside area around the lobby...",
  "This place is terrible the only reason I stay here is because of the truck parking. If you like cheap hookers and meth heads with a side of homeless this is...",
  "You will not find a better Chinese takeout place than Good Eats!! Amazing combo plates!",
  "Since discovering this place, i was hooked. I would consider this chinese restaurant one of the better place for my chinese takeouts. The food is great;...",
  "Since trying this place I'm obsessed.  \nThe staff is friendly,\nI typically get the 2 item plate \nThe chow mein is so good, the orange chicken &  sweet and...",
  "Bought couple of Pad Thais here a couple of times during the Covid lockdown as it's right down the street! Came through to pick up with no issues. Food...",
  "This spot is a place to take your whole family to the food is great and the people that work here are very kind .They are just really awesome and this...",
  "It's my first time ordering Phad Thai from pho 76! At first I was skeptical about its but then I gave it a try and it was delicious.",
  "My mother wanted to try their lunch. She called and spoke to Anita. She was very nice. She ordered 2 of the Mississippi Trios. Mine with chicken gumbo and...",
  "So happy that Huckleberry's has been able to reopen during this pandemic. We arrived on a Sunday morning at 7:00 AM - they started getting busy just before...",
  "Service indoors was amazing, seats were appropriately distanced, the service staff was super attentive and nice and the food was delicious! I recomendable...",
  "This McDonald's provides excellent service every time I go. Despite how busy they constantly are they always put on a happy face and try to cheer you up...",
  "I used the mobile order app this morning. Besides waiting for no more than a minute, I was greeted by name from a tiny,blonde,older lady who was sweet as...",
  "Went to drive thru for their new chicken sandwich. Sign says regular, spicy, or deluxe (picture shows lettice and tomato but no description of ingredients...",
  "This is the second time i tell them what i want and my box is completely opposite, why sit there and tell them what i want when they just mess up my order!...",
  "Service, quality of product, and consistency have declined significantly over the past 18 months. This was my go-to spot for Taco Bell for years. Sad to see...",
  "Where's the meat? Tbell has gone downhill drastically. Wife's lettuce was also old and turning.",
  "I got the enchiladas with rice and beans. SOOO GOOD! I can't wait to try the rest of the menu! Great food. The micheladas are also really good. Must try if...",
  "After learning that Don Pepe's no longer has enchiladas on the menu, my co-worker suggested this place as it was nearby our work and she claimed it was...",
  "I've been eyeing this spot for a while and I'm so glad we finally checked it out! This is hidden in the shopping center off of Cedar and Herndon next to R&N...",
  "Sushi is delicious and their little outdoor patio is great - koi pond and all!! \n\nWe came here and enjoyed the sushi tremendously. The only downside was...",
  "Sooooooo good! On our way up to Yosemite or San Fran from LA, we ALWAYS stop here for some good Japanese cuisine. Everything on the menu is delicious and...",
  "One of the best sushi spot in town. Lunch menu is great $12 any sushi roll. Customer service was sweet & friendly. My big party got seated fairly quickly....",
  "They make \"Hmong style\" papaya which is vegan friendly. That's what they've called it to me since even with the previous owners lol. Probably my favorite...",
  "Wow oh wow. I had to adjust my rating big time. The quality of the food has plummeted faster than the Apollo 13 and I feel so bad for the family that owns...",
  "The food here is pretty good. The soups are good. They give a nice amount of meat. It's a little pricey but it's kind of the norm in Fresno. I especially...",
  "I just want to say thank you to Araceli for being so kind and sweet she has spectacular customer service and a great attitude  keep up the good work your...",
  "So disappointed first time i let it go but second time no. I paid 3.49 for a side a hash browns and this is what i get! And not to mention they forgot to...",
  "A-OK because it's a Denny's afterall.  Denny's is like an American staple.  Denny's is that place that you don't necessarily go to because the food is out...",
  "We were greeted as soon as we entered thru the side door. I liked how they had one door for the entrance and one door for the exit. Social distance and...",
  "Pretty standard Panda Express! Hot food, order was correct, and honestly the drive through line went way faster than I expected.  It's A-Okay, because well,...",
  "I've been to this Panda Express a few times, but this time was disappointing. My husband went to pick up food and I ordered a 2 entree plate with...",
  "So amazing!!! Super healthy, everything tasted fresh (salmon, spicy tuna, crab salad, scallops, many veggies) and arrived at my hotel 20 minutes from my...",
  "I decided to try Pokiland for the first time today. It was absolutely delicious!  These days because of the pandemic we order delivery a lot. Ordering was...",
  "We were on our way to Taco Bell for a quick dinner. Our boys asked if Pokiland was open next door. Glad they asked!...they were open and we helped ourselves...",
  "At a time Hilton Garden Inn Clovis was at its wort disposition, I gave them a stout 3-stars.\n\nMe and my friends checked-in here at the Hilton Garden In...",
  "We went to lay down into our bed and found hair. I dont mean 1 piece, but literally all over the bed.  No apology, just a we'll run new sheets up. Thats...",
  "Stayed at this Inn as I was in Clovis for a training course for work. The desk clerk was very pleasant and explained the procedures for turning on the room...",
  "Covid-19 phase: \n\nMasks worn by workers and required! \n\nMy mother called and ordered the spicy Cajun boil for us to split along with two side salads. One...",
  "This was about a week ago and I had the chance to Yelp it now. I love this place!!! Don't worry they follow all the COVID guidelines. The atmosphere is...",
  "This place was a bath bomb of bbq\nIn door dinning great tri tip and my honey ate all the cream corn and I ate the beans she now has to drive for 5 hours...",
  "I love this place, I crave their food almost everyday. People have too thin of skin. Just because the servers don't sit there and stroke your ego doesn't...",
  "Finally came back after 9 months...  nice outside seating because of COVID-19.   Food was hot and delicious!   \n\nStill take a star off from the time they...",
  "Was very delicious! The spring rolls were kind of skinny, but still good. My only thing was that for a pick up order, there was a lot of broth (which isn't...",
  "Thank you Tahoe Joes for working with the community and offering an opportunity for our Catholic Daughter group to partner with you and do some fundraising....",
  "Tahoe Joes is on the corner of Herdon and Cedar and is one of my favorite places in Fresno/Clovis to get a steak or a rack of ribs. Came in Sunday during...",
  "Tahoe Joe's hooked us up right tonight‼  From the Mai Tai's, mixed green salad, rolls, spinach dip app to our wonderful meals (Prime rib, Pistachio Crusted...",
  "Traditional wings are always a favorite from here.  My husband enjoys the boneless.  So I think we did one of the family packs.  The fries are okay, but...",
  "We wanted wings and we saw they were having a BOGO on Thursday's, so why not? We arrived around 11am, and I saw they had people seated outside, so dine-in...",
  "My bf and I are getting boneless wings for the second time in less then a week! We ordered online and were able to pick up the food in a reasonable amount...",
  "Probably one of the best theatres in the central valley, always clean when I visit and located in a great spot with great restaurants and shopping. Most...",
  "The cinema has been updated, so it's time for a review update!\n\nLast time I reviewed Edwards I mentioned that some of the seating was getting a little tired...",
  "Huge theater yet they still managed to deliver a delightful matinee screening of Maleficent, perfect-for-picking at chicken nachos and a surprisingly fresh...",
  "Order for 12/8: \nSo yes, totally understand about CoVID and wait times. However! No communication for delays is what gets me. My pickup time was 7:16. I got...",
  "I come here very often. Before the pandemic especially for the 25¢ wings. For the Most part I got great service but not this last time. They brought out all...",
  "After I made a order with door dash for the hanger and they cancelled my order I was so mad so I decided to order Applebee's because they where the only...",
  "A year later and still our favorite restaurant in Clovis for Mexican food. Did take out today - super friendly and positive experience. Oh, and great food!...",
  "Wonderful place. The service was excellent, thank you Lynda! ;)  The food is of high quality and the it came out quick. To be honest, it was romantic as...",
  "This Mexican food is one of the best I've ever had. The enchilada sauce and the rellenos are exquisite. The most consistent restaurant for tastiness and...",
  "I only eat a few things here. Not because I don't like their food or because it doesn't appeal to me but because they make a killer seared ahi tuna! I can...",
  "Location: spacious, gorgeous and huge. Ample parking right outside and lots of space for indoor/ outdoor and covered outdoor dining during covid...",
  "Fresh seafood in landlocked Fresno? Yes! Food is beautifully plated and the menu is varied. \n\nFor apps we had pistachio crusted calamari and clam chowder....",
  "Covid-19 phase.\n\nFound another Chipotle!  Ordered on the app. Plus you get good rewards. Ordered a barbacoa and chicken salad. Brown rice and black beans....",
  "Really busy during the afternoons so try your best to accommodate when you go here! I'm a big fan of their app and they either have it ready or I wait for a...",
  "Trying to order and eat their \"new\" quesadillas is very difficult. What a let down.",
  "COVID-19 phase: \n\nMy mother called and ordered  the chicken tikka combo w/ a garlic naan for me. Hot and spicy and my mother picked the chicken curry combo...",
  "We just got Iftar from here today, we live in Visalia and were going stir crazy and decided to take a drive for take out. I know, I know, way too long of a...",
  "Family owned, sweet waiters, and dosa are like Indian hot pocket to me. :) \n\nMy favorite South Indian restaurant",
  "They're open for dine-in! While the food is still great, the service is slow. Be prepared to wait for your food and server. We spent two hours there and...",
  "Missing a star for no rice paper....... is it just cause of the pandemic or do they not serve rice paper? WTH.....I need my rice paper",
  "With the reopening to indoor dining, Shila's food has not changed one bit! Me and my girlfriend's family were sat down quickly as soon as we walked into the...",
  "Love the banh mis here! The meat is very flavorful, you can especially taste the lemongrass. Friendly staff, clean inside, and the prices are very good....",
  "Excellent spot, I dined in recently and they are following the void procedures. I always order pho and rice plates here. The food is good, I haven't had any...",
  "Called-in for an order for pick up. The lady who took my order over the phone was rushing me, asked me when I am coming for my food after I gave her my 2...",
  "This Subway is immaculately clean and inviting.  I am a frequent customer and the  service has always been courteous and patient. I'm big on order full...",
  "The two girls at the counter made my sandwich wrong, twice.  They were clearly not paying attention... to anything.",
  "This is the second time I've walked into this location and both times horrible service. The same two girls where working and neither one greeted me or the...",
  "I came here after my late night adventures as I was staying at the Radisson next door. The casino itself is nice and spacious. I didn't come to gamble, but...",
  "When in Fresno I usually eat Breakfast and dinner here (I stay next door at the Raddison) you can have asian inspired (I usually have Pho for dinner ) to a...",
  "This little $12 plate of papaya was \"Lao style\", I asked for 10 thai chilis and the bartender brings me 10 thai chilis on the side. Not sure if he was being...",
  "I love this place, but it's honestly hit or miss. Most days, the food is bomb! Their #2 pho, pad thai, and pork belly is my go-to when I order for the...",
  "They serve yummy pho here as well as other dishes. It takes a while to get your food, but everything is always really hot when it is served. They haven't...",
  "Nice people, and delicious food. I order from them, and use to eat in before the shelter in place. I recently had them cater for a funeral. They never...",
  "I came to this Mc Donald's on 11/19/20. I really don't go to Mc Donald's often as I am trying to maintain my healthy lifestyle Change.\n\nAnywho I wanted to...",
  "I am not making this up. I literally found a bread bag clip in between my pancakes today. Who ever made this order at 10:30AM on 05/10/21 completely failed....",
  "*I know this picture might be disturbing to some people* gave my baby this sandwich & my baby started choking!!!!!!! WHAT THE HELL!!!!! It wasn't in just a...",
  "I've been here multiple times and it's always delicious. Got there and they has really their patio dining open. It was nice in there. Our server was very...",
  "COVID-19 phase \n\nHappy 4th of July Yelpers!\n\nMy mother called and talked to Dustin and he was very nice and helped her with what to get. He recommended the...",
  "Patio was warm and inviting had to sit on patio due to COVID but our meal was delicious and we will be coming back. Had the spicy ramen ***** yummy",
  "Absolutely LOVE this place& it is my daughter's FAVORITE SUSHI PLACE!!!! It's always clean & staff is always friendly! Wait time on food is . . . . I've...",
  "My mother called in and ordered 2 sashimi bowls, garlic edamame and muscles.  It was before they opened at noon. The worker was very kind and said they...",
  "LOVE this place. Even thru the pandemic they stayed open.  It was always clean and I felt they handled everything with care. Staff is amazing!\nRecently I...",
  "My daughter wanted Olive Garden for her 30th Birthday and that is what we ordered for her.  Of course because of Covid 19 we ordered on line and picked it...",
  "Had a lovely dinner tonight Mike the manager was amazing and our server Susan was very helpful !",
  "Worst meal at an Olive Garden ever.   \nAlfredo sauce separated n dry   - granddaughters fries luke warm and no salt.  Salmon zero flavor - garlic Parmesan...",
  "Whenever I want Sushi this is always my go to spot. The sushi is always amazing and the staff is always friendly. I called in yesterday (Mother's Day) to...",
  "We have been a regular at Wassabi for 12 years, even before they switched to their newer location. Their quality is always very good! Although recently,...",
  "My 666th REVIEW, The sister, her boyfriend, niece, the dude and I came here on 11/01/20 to celebrate her becoming an Nurse! We had to celebrate her...",
  "Pieology is one of my top places to order during this crazy pandemic. I have their app because the rewards are actually worth it. So I now order online and...",
  "YUM! Covid-19 take out only! Happy Saturday! This pizza made my day! I loved my personal custom made pizza! For $ 9.29 (it'll feed me for lunch & dinner)....",
  "Finished my day of errands with Pieology pizza! This is the first time I ordered pizza from this location. Unfortunately, it will be my last. The inside...",
  "I ordered takeout sushi while on FAT layover. The Football was delicious and quite large. I am looking forward to trying other roles.",
  "Hands down THE best teppanyaki in the general Fresno area. Great food portions, amazing fried rice, and great customer service. Prices are cheaper than...",
  "First time here. My husband was recommended by coworkers that this place is the hit for sushi and teppanyaki. The ambiance of the place was very chill and...",
  "Pleased that you could sit outside with COVID still an issue.  I had Osso Bucci, outstanding.   My wife had Pesto and tortellini with chicken the same there...",
  "Absolutely incredible. Best Italian restaurant by far. We went the first week upon opening during COVID and I can honestly say even with all the...",
  "Best Italian food in town! Too many favorites to list, so try the whole menu! Indoor, outdoor dining, beautiful bar. Comfy place to relax and chow down on...",
  "Long waits and never seem to add the extras I requested. Flabby, don't bother, lettuce. I like the food but far too often have to take it back up the...",
  "If I could give this place a lower to none stars I would avoid the drive thru way to long for a fast food place . I love their food but not this location",
  "Don't go to this Wendy's!!! Made my order, drove up to the window, and the server had a mask on but not covering her nose. Looked at her, and told HELL NO!...",
  "Wow!!!!! I ordered via UberEats delivery today, and it was a feast!!!!!! \n\nI wanted to order enough to have leftovers for tomorrow, as I am an over the road...",
  "This spot located downtown has been absolutely amazing. NOTHING can beat their meal deal right now. Not only are the staff very attentive and great, but the...",
  "My experience was good on 07/15/2020. I ordered 4 dishes for pick up. The order was ready for the time I requested. Everyone enjoyed the 3 different dishes....",
  "Took the drive thru. Ordered a charbroiled bbq chicken sandwich and asked if jalapeños could be added. That was no problem. Took the order home. \n\nThe...",
  "Been a year since i stopped by .What a total disappointment again after a year !  They have gotten even worse .  I ordered the number 2 meal . It was a...",
  "I can understand the bad reviews and the poor rating!\n\nZERO customer service from the nasty ladies who work there!\n\nI ordered a BEYOND BURGER combo at...",
  "If you're looking for some savory Thai/Lao food, look no further! The chicken pad Thai is full of flavor. The waitress was very inviting and sanitized a...",
  "Finally restaurants are open in Fresno for dine in. We wanted to try something new and walked in not knowing what to expect. We were greeted by a very...",
  "COVID-19 phase: \n\nI called in and ordered  the pad see ew w/ spicy chicken to pick up. The worker was very nice and said it would be ready in 10 minutes! I...",
  "There food is super good but there service sucks. They need to have more people on the floor to assist.",
  "Takeout service sucks. I hate that I still be coming back sometimes but that's just cus they be open late when I have the munchies and crave certain things....",
  "Was craving pho this morning and came across pho 75-2, the highest reviewed pho place in Fresno! Due to the coronavirus, everything was takeout so my...",
  "We visited on a Saturday night and it was pretty busy for indoor dining. We waited an average of 45 min. to be seated which is pretty normal for a Saturday...",
  "Around first time coming back to this place .They were very Covid safe with having plexiglass up on the booth seats also everyone wore mask All menu were...",
  "I ordered to-go for the first time y'all. I like to eat my food super fresh so I was hesitant about ordering online, but... this team provided me with fresh...",
  "I've been here in person three times and have ordered take away at least 3 times since Covid began. The food is very good but the two times I ordered...",
  "The Red Dragon Roll was yum! Got it to go and the presentation was nice! Even in quarantine they do a present the food fancy! Will be getting again!",
  "I tried this business for the first time after passing it for several years. The inside was beautiful; unfortunately because of COVID-19, we were unable to...",
  "This is one of my favorite places to eat, the food is consistently good quality. I have been here many times and never walked away feeling like I didn't get...",
  "COVID-19 (Nineteen review challenge)\nLocally owned businesses only:\n\nReview #6:\n\nBest Chinese food this side of town. House made dumplings are the best, and...",
  "Hunan is so good! As my husband says it SLAPS!! Everything we've ever ordered is so delicious. Their potstickers are by far my favorite. Last night I got...",
  "This place is a very family oriented option. The staff was extremely friendly upon arrival. The managers made sure that everything was clean and restocked....",
  "The staff here was amazing but we seen a roach. The manager addressed the situation. The food was OK, the dishes were clean but a bit wet. \n\nAs  I passed...",
  "This was the most horrible buffet I've even been to. \nLate lunch but yuk! Dried out fried chicken with no batter coating what so ever!\nOh did I mention a...",
  "Very consistent with their take out orders.  I usually order online.  The only thing that might've happened in today's order was there was a glitch.  It...",
  "COVID-19 \nMy mother ordered on the app to receive 10% off. She ordered the  lobster, shrimp and salmon. Baked potato and green beans were chosen for the...",
  "The self-quarantine of everyone in California and they \ncoronavirus pandemic has led to the closures of the restaurants. We now have more options for eating...",
  "This is my nieces' favorite place to eat, they choose to grab food from here on every birthday especially when feeding a lot of people. I've eaten from here...",
  "Wonderful local Clovis Chinese food with a wide variety of delicious selections. Has a very convenient ordering process and food delivery at their doorway....",
  "The quality of food and portion sizes are still outstanding. I was worried when they temporarily closed due to COVID-19, but upon their reopening I was...",
  "Do not order delivery during COVID 19. They have failed to delivery the whole order everytime we ordered during COVID. \n\nIf you pick up your order and it...",
  "The dude and I have dined out to this DiCiccos in Old Town Clovis about 2 times in December 2019 and January 2020, as we came for their comedy show. We...",
  "I do have to say this was my first time trying it and man was i impressed. We had take out and i ordered the Chicken Alfredo and my husband ordered the...",
  "HAHA Sushi has some of the freshest sushi in Fresno! the Bento Box lunch is amazing for the price and gives you a ton of Food. Due to covid they offer...",
  "Great place for take out, I hope the restaurant opens soon because the counter service is amazing.",
  "Doing my part during this tough time and I was craving sushi. It took me a while to figure out what to order, so I had to look at pictures. I got the Let Me...",
  "Wonderful Eggs Benedict.  \nSee my reviews on Benediction and IHOP for my rants on this subject. \nPoached perfectly. Hollandaise was perfectly wonderful. AND...",
  "Food left me quite wanting since it fell pretty badly. The service was really good though. They checked in frequently and helped with any questions that we...",
  "First impression when walking in was prompt and welcoming. The place was cozy and we were seated by the door. Looking at some of reviews I did notice that...",
  "This spot is offering a 3 sushi roll + 1 appetizer for $20 togo during COVID! Sushi quality is pretty decent for the price. But the real highlight of this...",
  "Delicious! Outdoor dining during covid, water misters and friendly staff.! We had sushi rolls that tasted great,the salad dressing and soup that came with...",
  "Me & my cousins recently just went & we each got the 3+1 = $17.95  with taxes it was 22.30. They had great customer service, the waitress was very...",
  "Food was amazing, that gets a5 star review for sure. However every time we get takeout the packaging is always wrong. No wasabi for me thank you!! Lol. But...",
  "Beautifully plated and delicious rolls and sashimi, especially considering it was takeout!. Delicious sauces I havent seen anywhere else.  Great service. We...",
  "We are a regular dine-in customer at Sakura Chaya and have always enjoyed the great service & meals there.  We ordered our first take-out recently and...",
  "I'm not sure why I haven't done a review for this place as I love their pizza and customer service, I even decided to get their app. The many time I been to...",
  "I love Round Table Pizza and this is my favorite one in town to get it. The restaurant is nicely updated and they have self serve beers on tap with ice cold...",
  "My favorite go to spot for wings, pizza, and beers on tap you pour yourself! Round Table Club House has a great vibe, and the food is always good. They are...",
  "I ordered takeout recently. I was pleased to see so many vegetarian options, including an inari (!!) roll. I also ordered some crazy edamame to share...",
  "Easy to order via telephone for take out. Friendly staff! I got: sour salmon roll, I added Siracha and some teriyaki sauce and some lemon zest on top and it...",
  "Great place to bring your family. All staff where wearing there mask every clean and nice. .Good customer service and the food is amazing.",
  "Fast clean service. Ordered online for pick up and it was ready in lighting speed of 10 minutes.",
  "Let me tell EVERYONE. CRYSTAL @ 710 W Shaw Ave Clovis, CA  93612 United States IS THE BEST. During this Covid period a lot of customer service has gone down...",
  "The best thing about this Denny's is the staff. Even with all of the regulations going on and them having to serve outside, and today's super cold and...",
  "We were driving around trying to decide what to eat. We passed by this location and thought, we haven't ordered food from here in a while. I made a call to...",
  "My whole family got food poisoning from here! Avoid at all cost, the whole family was throwing up all night, will be reporting to the health administration",
  "I paid $67 for pizza and half of two of the pizzas didn't have any cheese or toppings on them! The pizza pictured should be a DOUBLE pepperoni and isn't...",
  "COVID-19  Phase:\n\nIn these tough times they seem to have it worked out. They have a front row parking area dedicated to customers who order to-go.\n\nMy...",
  "I haven't been here in a min. but decided to order some take out since it was nearby and we didn't want fast food. I was in the mood for rib eye so I...",
  "Out here visiting family. This restaurant is one of only a handful that is doing dine in with all the guidelines met. Every other table had a reserved sign...",
  "I placed an order through Postmates at 9 o'clock, the order was accepted and everything seemed fine. Then 20 minutes later I get a message from my delivery...",
  "This place sucks ass! Ordered the $20 fill up and they left out my biscuits and gravy. I saw the bad reviews and thought I'll give them a chance. Fuck that...",
  "If there was a rating option for 0 stars. This would qualify. Idk who actually owns this franchise but whoever it is they need to fire and rehire all their...",
  "Their sandwiches are good. I especially enjoy the fries and jalapeno poppers. This location has prompt service and friendly staff.",
  "I go to the drive through and it's usually quick. My go-to sandwich is the regular roast beef. Just thin slices of roast beef and the bun. Add two packets...",
  "It's in kind of a rough section of town compared to Clovis. A homeless guy came in with a drink cup and got scolding for stealing a free drink and then he...",
  "I wanted to try something different. The worker was nice. I asked what was popular. He said a bunch of different combo numbers. #6, 7, 11 and 13. I picked...",
  "This spot is completely vegan! The vegan meat was absolutely delicious! The texture was as thick as a steak and I had to use a knife which I enjoyed. The...",
  "Are you still live down in Southern California and worked a lot in Los Angeles. I have been craving vegan take out. I stopped by and not only was the food...",
  "This place is open early and has awesome spring rolls and pho.... and egg rolls .... Covid making it hard but they made it happen",
  "Great food, pho was very good, the sandwiches I had a traditional and another one. Bread was very soft and very affordable. I'm looking forward to eating...",
  "Food was great and service was great and extra fast! I was pleased to see how fast it was to receive my food, they were very good at being attentive to my...",
  "Ordered for take out. Food was well packaged. Everything we ordered was there. Ordered extra fried rice because it's that good!",
  "This was our first time during the pandemic to have ordered take-out from Edo-Ya-Tokyo Cuisine. We were not disappointed. It was wonderful!  It felt very...",
  "My absolute favorite place in the whole world to eat tepanyaki! No one can match their flavors or sauce! Not to mention the bacon fried rice that absolutely..."
]